[{"title": "1 News!", "date": "12-10-2019", "href": "/_pages/newsblogs/12-10-2019.html", "src": "/assets/img/in/1_m.jpg", "content": "Hello. This became a bit longer than expected oops. Anyway. Welcome to Peru.\n\n\nWe are in lima. It's mad and it's dusty and it's the most relaxed place I've known in a while.\n\nTime here is more languid, stretching out like Lima spreads along the coast to each horizon. We are living in the moment more so than I have ever before. We flow without forcing the shape of the day. There is no job, no stresses, no planning or dividing up the time. We are thinking ahead but only to the next meal, moving instead from minute to minute as between display cases in a museum, soaking up everything but holding onto nothing. It is good. It feels healthy.\n\nIt also helps that we're both drawing so much, filling up so many sketchbook pages a day it's sent us into panic that we won't have enough paper!  I found it hard to draw just for the sake of drawing back home - G is better with this, but both of us have benefitted from the change of pace and place to just let go and draw as a means of absorbing, processing sensations. Instead of putting pressure on the outcome as we are taught in school and college, and befitting two people who want to make a career in the creative industries, here there is nothing but Draw. Look, see and draw. I don't know how long the momentum will hold up, but it's been creatively loosening.\n\nWhat I've loved most so far is sitting in the back of J's banged up merc, driving and just looking. Most of our time has been spent in Tupac, in the outskirt district of Chorillos, where the buildings are built by hand, the streets are paved not with tarmac but with stray dogs and street sellers, and everything is coated in a perpetual layer of dust. The houses are rectangular and boxy, stacked up in natural growth up into the sides of the hills. It feels much like Manila - square houses, cables knotted up into salads above the streets, billboards and palm trees looming over tiny stalls as everyone works to make ends meet. But it's also more open, wide roads welcoming the flat grey sky that never presses on to the city as one might expect.\n\nIt's beautiful despite the all-pervading dust which makes each view look overbearingly brown (the colour of all the bricks here). But these views are dotted with the colours of washing lines and billboards, of janky coloured facades because here it only matters what the front of your house looks like. Every building has bare bricked sides but care is taken to decorate the front, be it turquoise (v popular) or pink or orange, regardless of the direction the house is facing. The result is a patchwork of angles and corners, colours and shadows, spreading over the hills of lima.\n\nWe've seen central lima as well but it's much more city-ish, westernized in its high rises and marble and flash cars. Tupac is better.\n\nEnough for now, will catch you up with what we've actually been doing soon!\n\nM+G\n\n"}, {"title": "2 News 2", "date": "21-10-2019", "href": "/_pages/newsblogs/21-10-2019.html", "src": "/assets/img/in/2_m.jpg", "content": "Hello from Peru!\n\nIt's Sunday and we've been here two weeks! Haven't noticed the days go by as we float from place to place, meal to meal, just enjoying the views. It is a different life here as J keeps pointing out, but not one we took much getting used to.\n\nWe're living on top of this ground-floor-shopping-centre-mini-arcade-thing (J is into 'microbusinesses') meaning there's always people downstairs selling and buying and fixing and working. Also hammering. Too mich hammering. Justino built the house several stories up though, and despite the bustle beneath our floor is wide open and very comfortable and hAS A DANCEFLOOR. Yes life is complete G and I have ourselves our very own ballroom and have already baffled and amused the men of the house with our incessant dancing. Nos encanta bailar!\n\n( the only difficult thing that I don't think I can become accustomed to is the lack of drinkable tap water, and worse the lack of ANY water when it sometimes runs out in the evening. Never in my life have I been so thrilled about clean socks and a shower the morning after a waterless night )\n\nGetting to know Tupac is fun; already got the feeling of \"ahh, how nice to be home\" after a long days of inner city and lima buses (almost as bad as the jubilee line - but not quite). We return to food on the table courtesy of our housewife Estik, G's quarter brother - they share the same half sister - with whom much Spanish is also practised. He does have a tendency to misunderstand so we come across as total blasphemous lunatics (the mad dancing doesn't help), but considering I have been learning Spanish for six weeks, and G hasn't done it since year 9, we get by decently.\n\nBut Tupac is comfortable. The madness begins when you consider J's parents bought this place 40, 50 years ago and it was on the edge of Lima. Beyond Tupac the farmlands started, but now we climb the turret on the 5th floor and there is just city, sprawling, stretching, melting into the mist. An ocean of dust with no horizon in every direction, it's waves crested with little Jesuses surfing the masses below. Poring over maps one may think Lima has almost the same size as London, but it is So. Much. Bigger.\n\nThe new revelation was the view from the roof of J's other flat in chorrillos, which we've been helping do up. The flat is on the top floor with a ladder that leads up to the tallest roof around, and nothing compares to the exhilaration of standing above this mess of a city, wind in hair, in arms reach of the swooping birds of prey that swirl like guardian angels watching over lima. It feels both calm and relentless, respite from the hustle while taking it all in.\n\nWe're in Lima for another week, and I already know I will miss it.\n\nM+G\n"}, {"title": "3 Lima 3", "date": "27-10-2019", "href": "/_pages/newsblogs/27-10-2019.html", "src": "/assets/img/in/3_m.jpg", "content": "Hi! Hope all is well in fair and brexit-ridden Europe. We're an hour away from heading to the airport to fly north, why must cheap flights be so ridiculously timed. We've had three weeks in lima, and while I'm so so so excited to see some more of the country, i feel ill already miss the dusty comfort of the city. We've done so much that we haven't written about so in the interests of efficiency we present: bullet points.\n\nWhat we did in lima:\n\nSwam in the Pacific which was far too cold to be allowed but we are British so it was piss easy. Got to swim up really close to gorgeous pelicans both sitting on the water and gliding over the surface between waves elegant and effervescent as Jesus, as well as very close to (and in the way of) surfers who kept falling off so were certainly not as great as Jesus. It's really hard to stay afloat in large waves when you're laughing this much.\n\nHad the pleasure of being rushed round a beautiful colonial Franciscan monastery in the most frustratingly fast tour momey can buy. It's built on top of the skeletons of 70,000 people (who were apparently made up of only heads and thighs - thanks quicklime) (quicklime has trouble decomposing large bones but is great for getting rid of bodies - pro tip from Gem).\n\nCried in church\n\nAccompanied J to all sorts of business meetings and Important People Events with politicians. Several days have now been bring your kids to work day for J - G and I are now pretty much official siblings because apparently we just look that alike? These people are all weird and confusing and not speaking Spanish doesn't help but neither does the political ambiguity that requires severe Googlage after each event to work out what's going on. Some of them have very big gold rings, which is particularly important to Gemma Who Is A Magpie.\n\nGot lost and frustrated on the (surprisingly efficient and well-organised) bus system for three agonising hours of bad luck, only to walk out of our final station and run straight into Justino, a complete timing coincidence and about the best piece of good luck I've ever experienced.\n\nRode a skinny horse through the mountains\n\nWent to possible the worst art exhibition I've seen in my life. It. Was. Painful.\n\nGot vip'd at lima's biggest gig: Mega Mass. Thanks to J and his contacts/events/secret service status we were given front seats to this enormous service in one of the gradients cathedrals in lima while the public clamoured behind barriers and stood through many hourly masses to get to the front and receive communion from a priest flanked by a man holding a big sign saying 'comunion'. Really felt like a rock concert except the pop star was god and the groupies wore vestments.\n\nFell through a roof. Namely the roof of J's shopping centre from the little tower above the top floor, prompting not the expected pity but incessant laughter from the household. Hole in the roof (made of corrugated plastic - I'm not that heavy) remains but tailbone is healed enough to dance again and stop me walking like a cowboy who hasn't seen solid ground in a week.\n\nWere consecutively dead for 4 days turning into detritus\n\nGot angry at rats and men who wouldn't believe us about said rats. Also protected the citizens of the kingdom (mice of the house) from a small round man armed with a toilet plunger.\n\nTaught the men of the house that yes, it is possible to eat vegetables, and yes, they really do taste that good.\n\n\nNow off to the moody north for hopefully less dust and more uncomfortable bus rides.\n\nHasta la próxima\n\nM+G\n"}, {"title": "4 Jaén to Trujillo", "date": "08-11-2019", "href": "/_pages/newsblogs/08-11-2019.html", "src": "/assets/img/in/4_m.jpg", "content": "Hi! Some news that isn't election related. It's been a while but we're back in Lima and sufficiently rehydrated. This might be a long one...\n\nYes we finally made it out of lima to see some of the country, and also to see some greeeeen again. Plants! We established on our first day in Tupac that the one tree outside the shopping centre is so coated in dust I had to lick it in order to get to the green bit, so were relieved to be surrounded by vegetation that isn't suffocating.\n\nSpent the last week with J, busing it down through the mountains from Jaén in the Amazonas region where the Andes meet the rainforest resulting in spectacular mountain vistas, our first taste of jungle and some extreme roads. Wobbly bobbly, as gemma put it.\n\nOur first couple of nights we slept in a teeny mountain village above Chachapoyas sitting most of the way up a cliffside. Aside from eating entirely too much banana (the main crop there) and suffering the resulting digestive fallout, it was so refreshing to be out in the forest, seeing the mountains on the way to the loo and watching the stars while sitting on it. There were hummingbirds in every bush, and more chickens than humans except the chickens here look like velociraptors attending a 70s wig party. They be funky. From the village we trekked through the rainforest soundtracked by birds and frogs to Catarata de Gocta, a ridiculously enormous waterfall that is so ridiculously big the water isn't even liquid by the time it hits the rock below. And that's only the top half of the falls! It felt good to stretch our legs after spending a lot of time in buses and tricycles, climbing up and down and deeper into Jurassic park. Rainforest did begin to live up to its name though, and by the afternoon I had to fashion myself a rain coverage with plastic bags while G just got drenched, like a real Indiana Jones thank you very much. We were accompanied by a chorus of frogs that were so goddamn close the entire time but Did Not See A single One. There were thousands. Thousands! (-G). But yes. Incessant rain. There's a reason these are called the cloud forests.\n\nNext we visited Kuélap, our first proper archaeological site perched quite literally on the top of a 3000m mountain. Built around 700AD by the Chachapoyas, a pre-incan warrior civilisation, it's incredibly well fortified by a 20m wall and so high up we got a cable car to reach it. The wall only has three entrances, so narrow they forced any invading groups into single file lines (!) and now keep the automatic lawnmowers (resident alpacas) from making a break for it. The site is super cool and well preserved, but honestly we were just so blown away by how beautifully overgrown it is now, twisted up in the roots of trees and draped in lianas, that it was kinda difficult to take notice of the myriad round stone structures (around 400?). Coupled with the endless mountains of farmland and forest stretching out into the clouds (how I do love to be on the tallest mountain) and I felt like those early astronauts discovering earth from space: travelling so far to marvel at the achievements of ancient man, only to be bowled by the beauty of nature.\n\nWe got to see our mummies in Leymebamba, except these ones were dead and less pretty than our mothers (<3) but still had enough leathery skin to look freakishly human. Most of them remained wrapped up and frustratingly far behind glass but close enough to give us a chilling drawing experience nevertheless. The longer we stared into their eyeholes, the more fucking creepy they became and by the end we were very very glad that most of the 200 mummies couldn't look at us like that. There was even a baby with it's foot under it's chin that was actually so cute I wanted to take it home and cuddle it (-G).\n\nFrom Leymebamba begins The Day of Many Transports, 11 in total not counting all the walking, which there was also a lot of. But yes in one day we took:\n\nThe night coach arriving in Cajamarca which was admittedly really really comfy and also managed to not throw us into the aisle despite us hitting some really long and winding mountain roads. And also had some jazzy music, that somehow never got bad\n\nCombi (mini tricycle) to the hot baths which the Inca bathed in before getting roundly defeated by the Spanish, and which finally satisfied G's bath craving and proved her to be the child of not one but two lobsters who can get into EXTreMely hot water (I just got boiled alive)\n\nChama (public bus made put of a converted minibus, not the safest mode of transport but by far our favourite). Chama chama chama chameleeeeeeeeoooooooon\n\nAnother combi that I'm convinced the driver didn't know where he was going\n\nMinibus to San Pablo that nearly left Justino behind because we didn't know how to say 'a passenger is missing' in spanish (we do now) and because he was getting food\n\nMotokar (bigger tricycle that subjects your entire body to every tiny pinhead in the road) to Kuntur Wasi\n\nPolice car back from the site, because G the magpie attempted to steal all the gold (no it was just because there was nothing else driving the road, and a highly enjoyable ride it was in which the two policemen capitalised on our englishness by just repeatedly shouting 'Manchester!' Or 'liverpool!' Because Football Is The Universal Language (that I don't speak.........)\n\nTaxi down the mountain on a rollercoaster road\n\nDoubledecker coach halfway to Trujillo but that would've gone all the way to Lima so we weren't allowed to sleep because J just wanted to go home to work and party and whatever else is so important in Lima\n\nMinibus coach thing to Trujillo\n\nTaxi to the hostel.\n\nPhewwwwwwwwww.\n"}, {"title": "5 Trujillo!", "date": "11-11-2019", "href": "/_pages/newsblogs/11-11-2019.html", "src": "/assets/img/in/5_m.jpg", "content": "Just had the exciting news that we're shooting off to Huaraz tonight (!) because apparently one conversation constitutes making firm plans here, which I am totally ok with because WE ARE SO EXCITED FOR THE MOUNTAINS! But this means we gotta update you on our stay in Trujillo, which is a very pretty desert town if you're into centuries of colonial oppression expressing themselves through architecture (we were into it).\n\nThere are so many archaeological sites in the area that we decided to Be Tourists and take a guided tour, which turned out in our favour as our guide spoke very clear, gesticulsted Spanish so that G and I actually understood far more than we expected to and could really make the most of it.\n\nFirst we visited some Huacas (temples) of adobe (mud brick, or Adobe Templebuilder TM) which is pretty astounding as to how they constructed such big solid walls out of just mud, particularly since most of the walls have been so eroded by weather since excavation that they just look like sandy lumps of melted cheesecake. Built by the Chimú, this pre-incan coastal civilisation is best known for constructing Chan Chan, the world's largest adobe city and a simply enormous archaeological site, our next stop. Again, its mostly just a lot of sand (in the vague shape of walls) but impressive in its scope. Annoyingly they only show you around a teeny tiny portion, partially restored and unrepresentative of the site as a whole, though this was later rectified ...\n\nAfter lunch there was horse dancing (marinera) with riders whose wide-brimmed hats certainly did their scary hairlines a favour, and then it was time for the crown jewel of Trujillo's archaeological history: the Huacas del Sol y de la Luna. Nestled under a mountain and only partly excavated, this complex was constructed by the Moche people some 600 years before Chan Chan and features remarkably well preserved murals and sacrificial rocks they'd chuck you down after slitting your throat. Can really visualise the red blood trickling down the grey rocks........ in seriousness though the colours are still so vibrant and there's an entire immense fucking wall of relief murals and so much colour and texture it's practically psychedelic in comparison to Chan Chan,  and that's only the Huaca de la Luna. Fucking loved it but spent most of the time frustrated that they haven't even begun to excavate Huaca del Sol because it's so expensive but we would 100% do that shit for free and it's been being excavated since 1983 and it's being reburied by the desert in the time it takes them to unbury it and it's frustrating that this place had barely any visitors and everyone just goes to Chan Chan which is a big pile of sand or Macchu picchu which is overrun as hell and even my guidebook barely highlights this sight when more visitors would mean more money to dig more!!!!!!! Grrrrrrrrrrrr!!!!\n\nJ decided to abandon us early to return to lima for all the parties he was missing, so we had a nice relaxed final day with him walking around the cemetery (refreshingly full of visitors and ice cream stands) (Brockley Cem take note) and at the beach in Huanchaco. Sea was too damn shallow to swim and fortified by sea urchins (which we only realised about 24m out into the sea so we held hands and screamed our way back to shore), but we were just so glad to have Proper Sunshine for the first time that we napped and promptly contracted MONSTER SUNBURNS. Correction: M and J fell asleep and G lay there sizzling like frickin bacon (which she misses severely) because she was unable to awaken the sleeping dolts (-G). It was true horror. G and I have always prided ourselves in our brown tannable skin so we were shocked and mortified (Dad woke up black). Sun, we bow down to your strength and majesty (our skin is still peeling now. We look like leopards :) but all the tan is peeling off :( :( :( :((((((((( and Gemma is literally cracking)\n\nBags were a pain to carry on our poor lil shoulders afterwards, but managed to have a lovely few days alone in Trujillo, walking around trying to escape the sun in markets and churches and the botanical garden. Also, buses! I now feel a bit more like a local because we can Get The Bus. No small feat. After checking out another cemetery, that felt more like Hilly Fields in a heatwave with the amount of people and screaming children running around, we walked down the big road and into Chan Chan - not the tourist centre but into the site, the ancient city.\n\nThe concept of fences apparently not having reached northern Peru, there is a joy and a sadness to something as monumental and historic as this being left to the whims of both man and nature. The innocent joy of children playing on the slopes of 700 year old temples was tempered by the melancholic crumble of sand beneath my hand each time I touched something, of the stacks of rubbish dumped by locals, of the undulating walls like sandcastles caught in a retreating wave. And there was a selfish thrill to exploring the place alone, walking into the unknown depths of history, two Indiana joneses in our own little kingdom of sand.\n\nWe did have a perpetual feeling of unease while exploring Chan Chan, not aided by the eerie quiet thanks to the soundproofing of the walls (some of which did still reach up about 4m) and the all-permeating sandiness in which anyone not clothed in their grandmother's carpets would stand out. There was a thrill to the danger though, and we felt better getting up high, climbing a massive hill of sand that may or may not be another unexcavated temple (they really need to get back on their digging). Looking out over the city, we saw the true vastness. It's so fricking immense. An entire day of trudging and looking and we'd barely covered a tenth of the site!\n\nWe really did feel like explorers of a new (old) realm, spotting ground owls and a huge dead dog, its skin mummified by the dry heat and death in its eyeholes. Some aggressive bashing on G's part later, and we'd liberated a few teeth from it's maggot-filled jaw. True adventure. However, we were glad to get out of the complex as sunlight was replaced with more feelings of unease, and though we only encountered a few people throughout the day we were relieved to be back on the road. Also because the sunburn was burning, and for lack of moisturiser we retreated to the hostel bathrooms and lathered ourselves in smushed banana like walking smoothies. We tasted goooood.\n\nIt was certainly nice being back in lima and reunited with moisturiser...\n\nM+G\n"}, {"title": "6 Huaraz: the cloud city", "date": "20-11-2019", "href": "/_pages/newsblogs/20-11-2019.html", "src": "/assets/img/in/6_m.jpg", "content": "Boo hope all is well\n\nIn an hour we head to the jungle, the depths of the Amazon rainforest to look after a German lady's chickens, and I really need to stop doing these updates right before we go somewhere new.\n\nSince Trujillo we had a few days in Lima of which neither of us remember literally anything (serious memory questionmark???) It's all blank and confusing, except what we did do involved wearing heels and ties and being fancy, going to the launch of the new 1 sol coin at the Bank of England, no, wait, Peru, and to the Ascots, wait, no, to the Lima version of the ascots which apparently doesn't involve wearing big hats. Or any hats. In essence, we've gone from white middle class in England to white upper class in Peru. We are so okay with this. People at the Coin Launch Cocktail Party included the head of the Banco Central de Reserva del Peru and the Minister for the Environment (because this is a frog coin yay) and we were mistaken for employees of both of these. Despite G eating three times the legal limit of cocktail party snack food.\n\nHad a week in the lovely Huaraz, 'Switzerland of Peru' surrounded by mountains we couldn't really see for most of the time. J came for the first bit, nightbussing it from Lima and then almost immediately jumping on a tour to Chavín de Huántar which involved driving over a pass at 4200m and (coming from sea level to this altitude in 10 hours) blending our brains into soup. We effectively slung our heads into centrifuges. Brutal. Thank God for coca leaves, as much a national staple as ceviche, and (to freak you parents out) the source of cocaine. No stress, we weren't out to get high, because we were already higher than we've ever been before and chewing coca helps the body against altitude sickness and also tastes surprisingly good (nothing compares to J's suggested method though, to take a shot of pisco every 10 mins. Not sure whether that actually helps against altitude or just makes you too drunk to notice).\n\nChavín de Huántar is one of the earliest sites in Peru, buried in the mountains and featuring lots of incredible stone carvings, but the coolest thing by far are the subterranean stone mazes and galleries used by priests in conjunction with hallucinogenics to scare people onto believing their religion. Along with conch shells for sounds and reflective minerals for strobe light effects, I now argue that 3000 years ago, Peruvians invented the haunted house. Bam.\n\nHad a few chill days with J going to hot baths and museums and Campo Santo in Yungay, a town that was utterly buried by a landslide in 1970. The site is now a flat slope watched over by Huáscaran, Peru's highest mountain which loomed menacingly through slits in the cloud, reminding you of the power of nature. It's kinda become a tourist thing now, but there was an eerie sadness to walking on the frozen lives of 25,000 people, heavy feet on unexcavated ground. Only 300 children survived, who were away at the visiting circus.\n\nWe did a couple more group tours to Nevado Pastoruri, an impressive glacier and Laguna Paron which was great for seeing the mountains (despite the constant curtain of clouds) although have to admit what struck us most was the Extreme Tourist culture encountered on these buses. So far we've been very surprised and also comforted by the large volume of Peruvian tourists at sites  exploring their own country - a product of the positive nationalism that is evident in the myriad flags and 3 minute long national anthem (which we are 100% gonna learn) throughout the land. There is a government push to incentivise Peruvians to travel within Peru which I think is great, and naturally living and travelling with J has afforded us many more local and peruvian experiences.\n\nThis was our first time really hanging out with so many travellers, most of whom had seen  half the world or at least south america on whistlestop tours of all the 'must-see' sites. It was super fun talking to everyone from all sorts of countries, but something about the 'traveller' attitude left a bad taste in our mouths. They seemed downright shocked to hear we're staying in just one country for six months , as if it's normal to run from checkpoint to checkpoint with only photos to remember having been there because everything is a blur. \n\nObviously we are not exempt from this, we've done a lot of tourist things and are taking multiple domestic and international flights and quite literally flying to the other side of the planet in April. But we've been learning so much about Peru, its culture and its history, talking to the people and getting to know it's idiosyncrasies. The more we learn, the more we want to learn, so are beyond grateful to be able to experience the country in such a grounded way. Don't worry, we'll (probably) still do Macchu Pichu...\n\nWas fun to meet travellers though, and we did get two banging nights of snooker out of them at this very local pool bar whose clientele was exclusively middle aged Peruvian men. A bit odd being the only young/female/white people there but it helps to be with a 6ft Canadian...\n\nAnyway, we're heading deep into the jungle for the next month, laying new roots and hopefully getting to know a new place with time. It's veeeery rural so our trap phone numbers are:\n+51 950 157 924\n+51 948 621 537\nNot sure what wifi situation will be, so we wish you all a lovely cold autumn for the foreseeable future while we drown in tropical rain.\n\nByeee!\n\nM+G\n"}, {"title": "7 MAchete Kingdom", "date": "03-12-2019", "href": "/_pages/newsblogs/03-12-2019.html", "src": "/assets/img/in/7_m.jpg", "content": "Hello fo the jungle we are in an internet cafe because apparently when flying to Iquitos we also flew back intime\n\ndont have much time to write have to get going on the three hour journey from city to our house which is in the middddddle of the jungle before it gets dark we have no electricity no water but a cat and the most incredible back garden: the amzon rainforest.\n\nwe also have machetes, and lot of cockraoches for which machetes havent yet proven massively useful.however the hammer has become a particually usefl squishing weapon.\n\nblooming best time will be more organised and send something thorough soooooooon\n\ngema and mereidaewyhstuyj\n"}, {"title": "8 Boooooooooaat", "date": "07-12-2019", "href": "/_pages/newsblogs/07-12-2019.html", "src": "/assets/img/in/8_m.jpg", "content": "Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooaaaaaaaaaaaattttt\n\nBoat \n\nWas tempted to make the whole newsletter just boat because yay we went on a boat and I have misssed boats \n\nBut life in the jungle is good there is rain and mosquitos but apart from fighting off ant infestations and playing tug of war with tarantulas (Gemma Exclusive, that) life is relaxed and chill and we now have three hammocks courtesy of all the Germans living in the house. Three Germans! Gonna take over the Amazon\n\nBoat this morning to see tapier and monkeys and jaguar better than all the jaguar skulls and chopped up crocodiles in market\n\nAnyway gotta dash the light situation is still unideal but enjoying the sun\n\nByeeee\n"}, {"title": "9 The Cockroach is Dead Long Live the Cockroach", "date": "21-12-2019", "href": "/_pages/newsblogs/21-12-2019.html", "src": "/assets/img/in/9_m.jpg", "content": "Oi oi, we're back and fresh (or not so fresh considering all the mould) from a month in the Amazon Rainforest! We hope you've missed us dearly, meanwhile we've learnt what it means to miss a great deal of stuff: drinkable tap water, drinkable any water, sun that sets after 6pm, refrigeration as a concept, cockroach free kitchens, going outside without offering yourself as a sacrifice to the Nourishment of the Mosquito Hordes, ya get the picture.\n\nIrregardless though - living in the jungle is incredible. You wake in the morning to the first rays of sunlight tickling the treetops (because the walls of the house are not made of wall but of mosquito net - there are but two layers of holey fabric between our sleeping bodies and the fancies of the jungle) and filtering through layers of canopy. Though, that is if at first you haven't already been roused by the war-cry of the monster rooster, a small velociraptor running round his own Jurassic Park. He's fucking massive, and scarier than any creature the jungle could throw at us. The tapestry of sound ebbs and flows with daylight - insects, birds, wind in the branches, rain, monkeys, so much more you can't identify. At night, when all you see is that which is illuminated by the candle, the chirping and buzzing crescendoes until you fell like you're sitting in a room surrounded by a thousand static TVs. Then morning rolls around again and you're spotting birds from the breakfast table or watching wee  transparent lizards scuttle across the walls like the most nature friendly computer screensaver.\n\nWe live in this big old wooden house that's falling apart, slap bang in the middle of the forest. Everything is so greeeeeen, leaves the size of paddling pools, any other colour practically forbidden unless provided by a butterfly (which there are infinitely many of). We had the massive house to ourselves for the first week or so, which meant lots and lots of Naked Time because it was just the perfect temperature to be frolicking unclothed. This was probably a mistake to do outside judging by the constellations of mosquito bites that amassed as we gradually got eaten alive, yet we could not resist the forest.\n\nBut there was no rain! Felt a bit cheated to be completely honest, you come to the rainforest and it can't even live up to its name. It got a bit critical since we had very little drinking water so i composed a lil poem:\n\nWhere is the rain?\nThey cried in vain\nFor the heavens were dry as dust\n\nBut wait they must\nFor the clouds to bust\nAnd the sky to cry again\n\n\nAnd lo behold! We got rain. Raaain. The downpour was like the feeling when you finally piss after holding in your bladder for too long. We immediately rain outside butt naked for what is undisputedly the best shower in the world. Standing with your face turned to the heavy sky in the middle of the forest, its green refreshed like a lick of new paint, surrounded by mighty trees bowing with the weight of the rain around you as the water streams all over you body. It was not the last of it's kind, but that first shower, after days of sweat and grime, was a cathartic cleanse of the soul as much as our our skin.\n\nWater situation was kinda funky: when it was hot we bucket showered at the well (watched by our guardian angel the football sized toad), collected rainwater for dishes and sometimes filtered to drink, if we couldn't be bothered to fetch drinking water from the magic pipe in the jungle. There's a certain primal thrill to the idea of 'fetching water', a hark back to simpler days of physical toil, which doesn't quite translate to tramping through the jungle for half an hour with 25kg on your back and falling into streams of water along the way.\n\nAside from the mosquitos, we've played host to a small army of cockroaches in the house (small may be the wrong word - some of these fuckers are the size of a newborn kitten, though rather less photogenic). The hammer has been put to more use as a Certified Cockroach Killer than it ever was for bashing nails into the wall, but they follow the trend or weeds and Kelly Clarkson: Destroying them just makes them multiply. I've never been able to sleep if i need to pee, but the terror of going to the loo at night in a stall riddled with cockroaches was enough to train my bladder into submission. Suppose that's something...\n\nGot lots more to tell of the jungle but ciao for now!\n\nM+G\n"}, {"title": "10 The German Invasion", "date": "23-12-2019", "href": "/_pages/newsblogs/23-12-2019.html", "src": "/assets/img/in/10_m.jpg", "content": "Aka The Jungle Blog\n\n(Sending this from Cusco we're a bit behind)\n\nIt's been a chill month in the jungle. Put us on the spot and we could not tell you how we whiled away all that time, though there were a lot of hammocks involved... Didn't even have to leave the house to watch the birds and monkeys leaping between treetops squeaking, or walk far to visit the tarantula stationed as guard at the entrance to the reserve.\n\nAfter several weeks of being pissed at blunt machetes, we discovered how to sharpen them - you run one blunt machete against another blunt machete, tadaa! We'd previously tried venturing straight into the jungle by the house but got about 15m before you could no longer move forwards, backwards or side to side. This forest is Dense. But finally succeeded in macheteing through on a solo mission to deforest the entire Amazon. Who needs cattle ranching or forest burning? Gemma and Mereida are On The Job. Seriously though it is impossible to move through this density of denseness without harming at least a few lil plants...\n\nDisappointed as we've seen no snakes. Except in Low Belén where market meets water (district of Belén Market that gets seasonally flooded). While peering over the Venetian waters, speckled with small long boats and morning sunlight, to a church on stilts, we saw bobbing in a net a teeny fish and a long fucking venemous snake. Naturally, I Gemma, wanted to touch the snake. So with M holding my hand, I stretched my wellied foot into the river, creating a current until it floated over. It smelled dreadful, but curiously it felt empty. We squished and squashed it to the amusement of the locals who felt it necessary to tell us just how bad it smelled, though we very much knew this already.\n\nAfter we lunched on the water (or in it, if we'd been one table further over) and I (G) dropped my fucking sketchbook in the fucking water. Book has yet to dry properly. At all!\n\nWe've seen more wildlife dead in the market than wild - Belén is scattered with the corpses of the coolest animals about. Skulls of jaguar, pelts of ocelot, skin's of snake. Heads of crocodile. Naturally we touched them all and both felt inclined to stretch our arms down the gullet of the crocodile. We were also both bathed in the rain of crocodile as the lady macheted the crocodile leg (arm? paw?) In half. We saw packaged up, but live, tortoises which come prepared in their own soup bowl. Anywhere and everywhere you can by anaconda wallets, jag tooth necklaces, none of this shit is even crafted with respect, its just a heartbreakign cash grab. The shock of seeing all this in one day made us need an extravagantly priced coffee that did  not quite wash away what we'd seen.\n\nNow the central market of Iquitos, that's where its at. Donde esta la fiesta? Here. (Yes we know that's bad Spanish but it's too catchy). Mercado Central is littered with kittens and cats, sprawling among minimal vegetables, indulging (or suffering) the heat and heavy air that comes from being so far north. Iquitos is the world's largest city inaccessible by road - you gotta fly or boat it baby - but you wouldn't know it from the sheer volume of motorbikes and tricycles that cruise the behind streets. No person is too young, old, rich, poor or well dressed to hit the tarmac on a motorbike. The peril of holding your baby in one hand and your chickens in the other while riding that cloud of exhaust fumes in heels is unknown to the unhelmeted hordes of Iquitos.\n\nNow us: we prefer the bus. Rainbow wooden buses with the Most ingenious window system (it's so clever!) populate the roads and are our way of getting from the concrete jungle of Iquitos to our real bit of jungle, 25km down the road (or further, if you add the distance travelled vertically when we bounce like buried babies over the desert paths). Loved the bus rides beyond anything, leaning out the window speeding south as city and pollution give way to forest and tree and sky. It's over an hour trek through village and farmland and forest from the road to the house, so we thought we were so deep in the jungle with nothing but insects for neighbours like true hippy dippy children of the forest. Until we looked it up on Google earth to find we're squished between two roads... there's still ample jungle to keep us satisfied though, and it's nice to know we're not too alone!\n\nDid have almost a week to ourselves in the house, before that gave way to a rotating cast of other volunteers. The argentinians were mainly just difficult to understand because they pronounce 'll' and 'y' like 'shhh' (!!!?!?!?!) and the Australian dude was pretty quiet, but we had an absolute blast with a group of Germans. There was a couple, and another girl, and me all being German so poor Gem came all the way to the middle of the Amazon only to be surrounded by Germans. But she can now appreciate how stupid Germany is :) It was refreshingly fun to be around young Germans, a new perspective on the country and the culture and the politics, but they all took the absolute piss out of me for my slight Bavarianisms. They also taught us the Way of the Hammock - stringing up an illuminati triangle of hammocks and proceeded to complete every task imaginable while lying down and swinging slightly. We really did not do much in the jungle, mostly reading and reading and reading and I read two whole books in German (!) (Danke Barbara für mein lesematerial) and man it was relaxing. Awww we miss the Germans. Goddamn and god bless them! They were wonderful but then they left. We were very sad.\n\nRight. Tomorrow it's off the Cusco, but we're writing this from the pool because after a month of slumming it in Cockroach Disneyland we deserve our lux. Every time we came into Iquitos we saw this hotel from the bus with a pool on it's sign so baby here we are, finally able to make the most of the tropical sun: alternately sizzling like bacon on the deckchair or boiling, like, well, boiled bacon? Boiled ham? in the pool. (I might be eating meat here but it's mostly chicken my ham knowledge is wanting).\n\nYour soon-to-be-brown Amazonian Warrior Goddesses,\n\nM + G\n"}, {"title": "11 Cusco: In the Land of No Cheddar", "date": "28-12-2019", "href": "/_pages/newsblogs/28-12-2019.html", "src": "/assets/img/in/11_m.jpg", "content": "Oh, right, the poison, the poison for Kuzko. The poison chosen specifically to kill Kuzko, Kuzko's poison......that poison?\n\n\nFrohe Weihenachten, Happy Christmas everyone, or Happy Chris-Max as we're calling it because we have made it to cusco and we are no longer a roaming duo but have expanded the fellowship (we're also reading Lord of the rings out loud).\n\nYes its good to be here, not least because Chris's flat has the most maravilloso view over Cusco nestled in the surrounding mountains. Every direction you look, there's mountains tickled by clouds, rising up as sentinels over this quaint little terracotta city. We're glad to be here for Christmas- more than anywhere else we've seen so far, cusco feels real European in its cobbled streets, wood carvings and ornate wrought metal, all it needs is a lick of snow to complete the picture. In the morning sun, the tall dark trees (European again, introduced by the Spanish because no trees grown here naturally) and waves of tiled roofs could almost trick you into believing you're in the Mediterranean. There is No Such Thing as a tiled roof (or even a roof) in lima because it never ever rains, so it's a nice change.\n\nMax arrived a day after us in a whirlwind of things we asked him to bring. Thank you max, for carrying! Thank you mums for packing!\nChristmas angels. Except Max may or may not have forgotten the crucial cheddar, which led to some tempestuous rebukes from both G (2.5 months no cheddar) and C (2 years no cheddar!).\n\nWe had a solid few days of Christmas because man it is hard work feeling Christmassy when there's no family to help! We miss you guys! For Christmas eve the three of us went to midnight mass which took place at 8pm (no not because of the time difference), but it was a glorious affair in the big cathedral that you usually got to pay 30 soles to get into. It's more a museum than a church, filling its high arched walls with painting after painting and also mirrors (?), presumably to reflect your Christmas sins. We had a few of those, attending two parties with C's teacher friends which may or may not have resulted in putting me Out Of Action for the best part of Christmas day... We did succeed in finally doing an intimate Christmas for the four of us, plus C's flatmate Toby the Kiwi who pronounces eggs 'iiiicks' and uses the word 'bötch' a lot. Thank you for all the gifts and cards, they finally made it feel like Christmas!\n\n\nThis is just a gorgeous place, can totally see why Chris and all his English teacher mates have chosen to settle here. It doesn't take long to get up the mountains around cusco, whether to clamber about the heaps of archaeological ruins that pepper the surroundings like a ring of fire, or just to last through bone-shaking lightning storms that frequently dazzle the city like Christmas lights. We were just chilling on this viewing hill (needed a break after climbing all them stairs because man the aaaltitude it hurts) and hail came the size of mint imperials, to be replaced before long by a downpour that sounded like an infinite number of stones rolling down a river bed, and the most fantasmagoric lightning storm playing all around us. Like a firework display the lightning drew shapes in the sky above the city, and a few times it came so close to our little spot that light and sound hit us at the same time.\n\nEven more time has been spent living out our Lord of The Rings dreams in the endless landscape of crushed velvet, choppy peaks and ruin after ruin after ruin. So many temples and stone structures sculpted into the echo of a civilisation long gone, living on in the cusqueñan outskirts as well as in the foundations of almost all the buildings in the city. (The Spanish were smart, they came along and destroyed everything incan but kept the strong foundations and just built on top of them). There's a freedom to exploring this history, constantly enveloped in the 360 views of the Andes.\n\nHappy New year's to you all!\n\nM + G + M\n"}, {"title": "12 Saved by the Batman", "date": "21-01-2020", "href": "/_pages/newsblogs/21-01-2020.html", "src": "/assets/img/in/12_m.jpg", "content": "Gemma and mereida go Shopping - a camping trip - new year - the day i saw god - a camping Trip - the fourth lake - copyright infringement\n\n\nBonjour and welcome to 2020! Yes I know this is late, but we've been busy and active and got a lot to tell!\n\nWe heralded in the new year with a camping trip to Lares, though it being rainy season and the middle of the Andes we were warned harshly against the cold. We had to delay the trip so we could pop to Barratios, the enormous weekly clothes market and Gemmas wet dream. Every Saturday, a whole barrio of nondescript streets explodes into a maze of second hand clothes, tools, food, shoes, pipes, llama heads, all your everyday needs. But G got a bit frustrated because she wanted to buy everything, and I got a bi5 frustrated because I can't handle so much shopping... Anyway, a few hours and hundreds of soles later, we were all kitted out in puffy jackets, jumpers and workmans gloves for a thoroughly cold camping trip!\n\nPlans change, though, and we ended up heading to the thermal baths (popular peruvian pasttime that should be adopted by britain) nestled deep in a strikingly tropical valley a queasy combi ride from Cusco. Had a bit of a hike but the main attraction was certainly the boiling natural baths which it was a challenge to liberate ourselves from, despite boiling long enough to be served up for Christmas. Such luxury! We sizzled and broiled for much longer than is medically advisable, and once night drew up the valley, climbed the side of the mountain to battle the thin air into making a fire. Suffice to say by the time we wriggle into the tiny tent we were very very very warm and all them fluffy clothes no longer came in handy. (I had such a hot night I had to jump into the mountain stream the next morning before our final soak, to get those prickles like rolling on Lego bricks that come from full body chilblains)\n\nHeat was good but may have messed up Max's stomach, who was therefore out of action for new years. I went alone with Chris and Mitch to a teacher party which for me involved less alcohol than Christmas but that didn't hold back Mitch and Toby who didn't even make it to 2020, opting instead for a comfy nap/complete-passage-out on each other. Great choice of flatmates, Chris.\n\nThe three of us had a few days of being tourists in cusco, which was nice until my brush with god: so we were just chilling in the Church With All The Mirrors when mass started and we wanted to sit and listen to the nuns choir (think sister act pre-dolores, or is that too mean?) when the priest came in and started being all holy and all of a sudden the world literally started to spin as if it jumped on a roundabout, the buzzing of an orchestra of bees rose up in my ears and my vision began to white out. We have sat through a lot of holy mass in this country, so what the fuck ?! I really wanted to stay and listen but every organ in my body was violently battling that desire, the floor was shifting beneath me and all o could see was blinding white. I had to leg it out of church barely 10 minutes into the service and recover outside from my brush with god, who later punished me for running away by serving me an allergic reaction to something milky. Very bizarre day, to say the least...\n\nAt the weekend we went camping again, this time with two of C's friends to Kinsacocha (quechua for three lakes, though would more aptly have been named four lakes) for a very different (and far less cosy) kind of trip. The walk up was hard, carrying tents and food and water (It felt like someone robbed us of all the breath in our lungs) but we were rewarded by gorgeous views of the sparse, llama speckled mountains and serene lakes, choosing to pitch camp at the top of a pass overlooking lake number two (ishkay in quechua) at the true mercy of nature. In the evening sun, we headed up to the third lake for an ice cold dip, and G and I had quite the laugh watching the skinny boys panic their way into the clear icy water. The cold was welcome at first, even after we failed (though not for lack of trying) to raise a flame to the wood we dragged all the way up the mountain (poor fire looked just how I'd felt traipsing up that path, though it didn't do us the honours of actually lighting). \n\nOnce it darkened and clouded over, everyone wriggled into their sleeping bags and got real cosy, and I was juuuuuust thinking to myself how soothing the patter of rain on the tent sounded when there was a SCREAM and Sheyla leapt up to reveal the collecting puddle of water at the bottom of the tent ! Suffice to say I will never forget the meaning of the word 'mojado' (wet). The water was seeping in through the base to form the fourth lake of the mountain right inside our tent, and from that point on no one would ever be comfortable, or dry, or warm, again. We did everything in our power to hold off the wet, lying on bags and coats and each other, but the key really was to give in to the elements and not move because each time you moved you just felt wetter. And colder. Unzipping the tent to find it surrounded by ice certainly did nothing for morale, but I suppose that's what you get for going camping during rainy season at 4 and a half thousand metres up.\n\nThe night was sleepless and uncomfortable but all in all we survived and had an adventure for sure. Was a relief like no other to arrive back in cusco and get warm and dry, and I love a good view over mountains but the view from the comfort of C's enormous bed over Cusco is unbeatable. Their flat has a perfect location - 20 mins from the plaza, at the relevant end of town with a smashing view. Only problem: on top of a hill! Enter: The Batman, saviour bus and most blatant example of copyright infringement. There's nothing like spending a day down in cusco and jumping on the Batman back home which stops right in front of our door, doing all the hard work back up the hill. And it's covered in bat symbols!\n\nOk next time Salkantay trek and something that rhymes with Cat Chew Peach Moooo....\n\nByeeee!\n\nM+G\n"}, {"title": "13 Neblina", "date": "29-01-2020", "href": "/_pages/newsblogs/29-01-2020.html", "src": "/assets/img/in/13_m.jpg", "content": "Hi, we're back and we're late again, been extra busy in the last two weeks but here you'll find out why!\n\nAfter his alotted three weeks of no-uni-time, we packed up Max with all our Christmas presents and shit to send back to London, packing his bag for him to fit in jars of honey, a goat skull and a llama skull etc. It proved a three-man mission but we succeeded, lessening our load though somehow we manage to accumulate Stuff like magpies so backpacks are still criminally heavy. After he left we spent a couple of days mooching about and fighting for the affections of Neblina, C's gorgeous grey cat (neblina means mist) who finally passed her very horny stage that lasted about a week of constant meowing, presumably screaming \"I NEED A MAN\" in cat language and getting her kicks from much arse-slapping on Gemmas part.\n\nDespite our aversion to tourist hotspots, we did always plan to do Machu Picchu at some point (can't very well be in Peru for 6 months without doing it, that's gotta be against some international law), but accessing the continent's number one tourist attraction is about as complicated as solving Brexit so we opted to do it as part of a 5 day trek. The Salkantay trek goes from Mollepata, a bus ride away from Cusco, over the Salkantay pass past Laguna Humantay and on towards Aguas Calientes, the access point for the site. At first we were like \"nooooo that looks really hard we won't be able to hack it\" since exercise has taken a backseat and even walking home up the hill makes you feel like there's a llama on your chest, but we were seduced by the prospect of the views and hired two sets of walking poles for good measure. Did briefly consider the Inca Trail but it's just four days of famous stairs and honestly we hate stairs....\n\nIt was an adventure leaving cusco alone, setting off bright and early to drive into the clouds. When we started walking there was still mucha Neblina, though the clouds seemed to play hide and seek with the view giving us tantalising glimpses of the surrounding mountains. At first our group seemed rather odd, a set of misfits compared to the overtly young, fit and European second group also setting off. G, I and Ewelina the loco firecracker Polish woman comprised the only Europeans in a largely Brazilian group, though we were also joined by a stoic Chilean air force pilot (with a hidden talent for singing along to reggaeton) and the nicest most chilled out Mexican Texan dude who keeps babies alive during heart surgery. I was sceptical but it only took a day or two for our group to begin feeling like a family, led by our impossibly young and sweet guide named Cesar who had an adorable smile and his own name tatted onto his arm.\n\n(Twas a bit weird being among the tourist population again, after hanging out with C's teacher mates who are all long term cusqueñans and feeling like a bit of a flake for only being in Cusco a month. Here, everyone was in the country for less than two weeks! What the fuck! I am so glad we got 6 months to explore this beautiful country)\n\nThe first day was a straightforward walk hugged by clouds, though I was grateful to only carry a day pack and send the rest of our stuff on horses (what luxury!) only because we learnt from camping that Altitude + Heavy Bag = Certain Death. After lunch at the camp we climbed up to Laguna Humantay, one of those brilliant blue glacial lakes that looks like it's either been photoshopped or had a gallon of chemicals emptied in. It really was that blue! The cloud curtain hesitated to shift from the peak, but we had a tantalising view of the glaciers and rockfaces that embellish the mountain.\n\nNext day was The Big One, and half the group were in a tizzy over breakfast (pancakes!!) about the big ascent to the 4750m pass. When they said we'd be walking 4 hrs uphill I expected, y'know, to be going uphill for four hours in the style of the Michalskys (UPHILL) but we barely even got to panting which is probably just as well considering we're not in shape. The clouds stayed to keep us company (more neblina) and the rain was pretty incessant all day so we were robbed of what I'm assured is an absolutely stunning view of Salkantay itself. It did feel a bit like going to an art gallery to look at blank canvases, but the walk was immensely enjoyable nonetheless and I got my endorfin rush at the pass from where the myriad glaciers climb up into the clouds. It's proper rocky and alpine, in contrast to the steep but velvety slopes of the morning, and while we held a small ceremony to Pachamama, the Quechuan mother earth, the snow started to fall so we were all grateful for the shot of whisky :)) \n\nThe 2000m descent took us from the snow through rolling green valleys until the trees got taller and the greens darker. Following this one path we walked into the jungle, as the open valleys began to close in and droop over us while the air got heavy with humidity. So many different landscapes in such a short time! Our campsite was surrounded by so many rich flowers it felt like a completely different country to the one we started the morning in.\n\nDay three the clouds finally fucked off to reveal the deep tropical valley we trekked through all morning, with rushing rapids and burning sunlight and NO MORE RAIN PONCHOS. Yes we have given in to looking like backstreet gandalfs in our ponchos and walking sticks, but therefore at least half my clothes weren't yet moist. After lunch we had a stretching session which just devolved into laughter at trying to get Betto the Texan to bend over with his arms clasped behind his back - he was just too wide! - and then were treated to a drive to Santa Teresa which felt quite perverse after walking so much. Didn't care though because we were DESPERATE to get moving and get to the hot baths because thermal baths are our absolute favourite thing because all we want to do is swimmm and also be warm and we've been to so many Baños Termales but never enough.\n\nMy patience was sorely tested but finally made it to Cocalmayo Baths, skipped group briefing and crept round the back to get straight in the water. GOD it was nice!!!!!! Huge warm stone pools with clear water and best of all, ice cold showers! And a mountain view to boot! It was fun just messing about with all the others, and G and I would've stayed in there forever had the promise of a party not eventually dragged us out the water. Yeah so we had a party with all the groups after dinner at the campsite, and let's just say this: tequila shots cost 1 sol. That's 25p. For an entire shot of alcohol. Suffice to say we didn't give a toss how bad the music was (it was Bad) because every single person proceeded to get absolutely hammered, unsurprising after all the walking and soaking in 40° water and dehydration.\n\n\n\n\nNext morning was interesting as everybody was somewhere on the spectrum between massively hungover and still drunk, including G who did nothing but stroke a puppy for the first hour of the morning. It . Most people went off to do ziplining (brave, I know) so a handful of us set out in the burning sunshine on foot to Hidroelectrica through gorgeous green valleys. The walk definitely helped the hangovers as it was the most beautiful stretch of path so far, but was glad to get to the lunch spot and collapse in a hammock. Only then did we realise a Brazilian dude who walked with us had disappeared after he walked on ahead, with no water or reception and speaking no Spanish or English. This was then worsened by the discovery his girlfriend had broken up with him the previous night, so the Paranoia Spiral began knowing I'd somehow lost a recently dumped manchild in the middle of the Andes. Shit.\n\nThis slightly marred the afternoon walk to Aguas Calientes that took us deep into the rainforest along train tracks. Here, surrounded by misty peaks and engulfed in jungle, I finally began to understand the mystic, the hype surrounding Machu Picchu. The whole area is guarded by huge sentinels of mountains, dug into the thick jungle and only accessible by train (no roads). I'd assumed that since the site has it's own lil town it would be less deep in the thickets, but god all I could think was how (and why) the fuck the Incas built here?! Aguas Calientes itself is bizarre as well, tall and paved and flashing like a Christmas tree so you feel you've stumbled on a mid-jungle casino town. The best bit about it though was we were walking up to our hostel and suddenly, there's Jonas the Brazilian, all happy and chilling as if nothing on earth could be wrong! I was so relieved to see him I practically flew into his arms, and then proceeded to be pretty pissed at him.\n\nEnjoyed our last night with our group and guide, being entertained with scandalous stories from the previous night - felt like school gossip - especially since Ewelina had been perfectly sober and could recall everyone's sins in painful detail. But best thing was the scalding shower :) then had to rise bright and early (in pitch blackness) to begin the tough climb up to Machu Picchu which is an hour of JUST STAIRS, and we were walking really fast. Yeah all those stairs were probs the hardest bit of the trek, but were glad to make it up there nice n early before the crowds (and xlouds) begin to flood the site. Once again we were blessed with neblina, like a pale shawl over the ruins and surrounding mountains, but we got our token postcard photo before the clouds closed in completely and felt sorry (or gleefully gayley happy in G's case) for anyone who arrived after....\n\nYeah so Machu Picchu is pretty cool, I'll admit it, it's big and intact and draped over the top of a mountain with stunning views across the misty tropical peaks. There are so many theories and suggestions as to it's purpose but nobody truuuuly knows, so it's just fun to traipse through the ancient walls and cobbled streets with an open mind. It's also far from the best example of incan building technique - allegedly built in only 50 years, it's crude compared to structures remaining in cusco and Cajamarca. But the location and the neblina did lend it a certain mystic, making us wish we had so much longer to explore it's mazes and caress its stones.\n\nThen again the rain was pretty heavy, and every time we got our sketchbooks out the sky decided to have a pool party. Furthermore, my absolute favourite view was not the classic postcard, or the chinese-esque cloud forest mountains, but looking back up the terraces from lower in the site to see THOUSANDS upon THOUSANDS of rows and clumps of tourists all decked in a rainbow of rain ponchos. It looked like a never-ending string of candy, a psychedelic anaconda snaking down over the 600 year old ruins. Class.\n\nSo yes, we can now say we have officially been to Peru, because apparently Machu Picchu is the only noteworthy thing in this whole damn country. Glad we went for sure, but it was the trek that made it, the people we met along the way, so the biggest takeaway was the empty feeling after it was all over. If anything, that shows we had a good time!\n\nYour officially Peruvian tourists,\n\nM + G\n\n"}, {"title": "14 A Small Detour", "date": "05-02-2020", "href": "/_pages/newsblogs/05-02-2020.html", "src": "/assets/img/in/14_,m.jpg", "content": "Hi from Peru, which needs to be specified because we just took a very thrilling and spontaneous detour.....\n\nYeahh so we were meant to sort out our passports a few weeks back, but laziness, too much queuing and a lack of desire for more queuing meant we left it a bit late. By the time we finally sorted everything and had wasted another full day in queues, they told us we'd overstated our visas and had to cross the border and re-enter Peru. Grrrrr.\n\nOur original idea was always to head to Bolivia from lake titicaca in a desire to retrace the steps of the Holy Trinity (Jezza James and Richard *), but then around November things started fucking up with their military coup and political protests which resulted in a closed border. Heard all sorts of stories about tourists being denied entry or just making it out of the country in time, so we slowly resigned ourselves to the fact that Bolivia may have to wait for a few years. Then out of the blue, everything was ok again, people were heading to la paz and we needed to cross the border! Could there be a clearer sign?\n\nWe had the flat for a couple more days after the trek, so booked our bus to la paz in the afternoon, packed up all our shit (god we bought a lot of clothes at baratios) and suddenly were on our way over the border. After months of comfort and staying in the same place, there was a sudden new thrill of adventure in spontaneously heading to la paz, about a day after considering the idea, just the two of us somewhere new with different money and NO GUIDE BOOK. I was supremely disoriented and stressed when we first pulled into la paz, mostly because we had no cash, no Lonely Planet (never going anywhere without one again, they're brilliant), not even a map of the city and the compass was too deep in the backpack. The huge backpacks caused another issue, branding us as wealthy tourists and sorely inhibiting our ability to run if needed. We've had absolutely zero scrapes or dodgy situations in 3.5 months in Peru, but barely an hour after we arrived in la paz I somehow misplaced my wallet and ended up having to buy three juices for thugs in balaclavas to get it back. We were both a bit shaken after this, but the worst bit was those were 7 boliviano juices which we wanted to drink ourselves!! Absolute robbage.\n\nHowever, once G had taken charge of the wallet because M is no longer trustworthy and we settled we began to really appreciate la paz as a city - immediately jumped on the loop of cable cars that glides over the metropolis like an army of angels, affording the most arresting views of a sprawling city draped into the valley and over the hills of the Andean altiplano. As we rose up the city just kept GOING, rising taller than lima with it's glossy skyscrapers yet retaining that Peruvian barebricked look, all to a backdrop of mountains. As evening rolled in the clouds rolled out to reveal Illimani, the jawdropping iced titan that stands sentinel over the city.\n\nWe were pleasantly surprised by the comfort and wealth of la paz - Bolivia is reportedly the second poorest country in South america, but this isn't really evident from it's de facto capital. The lack of a coast (stolen by Chile in the 1800s) has certainly harmed the country, but trade with Peru has ensured the apparent prosperity of this region. There was absolutely no sign of the recent political upheaval, which came as a complete surprise. It carries many similarities with what we know of Peru - barebricked houses, expansive street markets, traditionally dressed women dragging around alpacas - so we felt quite at home, though this time with added bread because Peruvian bread sucks and is just Sweet Air and somehow the ability to bake never made it over lake titicaca. We made it our mission on our first night to try as much new street food as would fit, which depressingly was not as much as we would've liked :(\n\nWe enjoyed a day of trawling the endless markets of la paz, a city made of markets that crowd every street, until needing to take a break in the gorgeous concrete cemetery slightly marred by the piles of empty coffins and frequent eviction notices on graves. But the real highlight of coming to Bolivia was after a night bus down to Uyuni (a bizarrely pale and open town that sports the best slide this side of the Atlantic) (also seesaws) when we boarded a 4x4 for a three day trip to the altiplano. Wooop!\n\nAfter a quick stop at the train cemetery, a mess of rusted iron carcasses, we began to approach the immense flat expanse that is the Salar de Uyuni. The world's biggest salt flats spreading over 10,000 sqkm on the Bolivian altiplano, the entire surface is so remarkably flat and blinding white it really is like entering a completely different planet. I felt like I was walking on Hoth, or the salt planet from episode VIII, because in every direction there is only horizon, pale blue of the clear sky marrying a white so brilliant it looks ethereal. Should probably have kept the sunglasses on, but I couldn't resist facing the Blinding brightness full on, just as we couldn't resist liberating our feet to feel the crunch and the crystals beneath our soles. (Also we ate a LOT of salt)\n\nThere were completely dry patches where the perfect hexagonal structure tiled the surface, but for the first time we were actually lucky to be visiting during rainy season because the thin layer of water transforms the Salar into the world's largest mirror, a perfect reflection of the wet sky stained by the setting sun.\n\nThe next two days we drove over huge flat desert expanses, punctured by smooth snowy peaks and prehistoric rock formations, mirror lakes spotted by countless flamingos (not as pink as expected, but just as cool) and so much more wildlife: vicuñas (the rarer supermodel version of the llama), suris (vertically challeneged ostriches), viscachas (inbred backwoods cousin of the chinhilla), everything. We began the day in burning sunlight and finished in wild lightning storms illuminating the Siloli Desert in a fantasmagoric display of heavenly power, cruising across the flatness in a tiny metal tin.\nHail\n\n The Laguna Colorada looked rather less coloured under the angry clouds, though returning the next day afforded us perfectly serene views of the rosy pink waters, overwatched by its own volcano sentinel. And again, so many flamingos!!!!\n\nIt was a pain being trapped in the car for so long, but worth it many times over for the remarkable landscapes taking you back millions of years. To cap it all off, we even got an hour in thermal baths perched down the edge of another beautiful lake, and we do so love a good hot bath :) Bolivia, you did good!\n\nNow with more stamps in our passports,\n\nM + G\n\n\n\n\n\n\n* See: Top Gear Bolivia Special \n\n\n"}, {"title": "15 At the copa copacabaaaaaana", "date": "12-02-2020", "href": "/_pages/newsblogs/12-02-2020.html", "src": "/assets/img/in/15_m.jpg", "content": "Hola chicos, the adventures of Gemma and Mereida continue, this time in true Traveller fashion as we begin city-hopping in earnest.\n\nLast day in la paz was spent clambering around the mud spires of the Valle de la Luna and squeaking with delight in the Alasitas Festival, a market dedicated to selling tiny weeny versions of things you could want for yourself in the New Year. Want a car? Buy a mini car. Therefore we bought tiny bricks and sacks of rice because in 2020 we wish to be inundated with bricks and rice, apparently. (They were just too cute!)\n\nFrom la paz it was back over the border to Puno, though not before a quick sojourn in Copacabana. We've had the manilow song looping round our skulls for months so were super excited to visit Copacabana, only to discover the song is in reference to the Copacabana in Rio, not the (pretty, but rather less cool) one on the shores of Lake Titicaca :(. No matter, we sung the song full volume anyway for a lovely ice cold swim which was actually pretty difficult considering the 3800m altitude. G and I both pride ourselves in our ability to swim in ANY water - a combination of being raised on English seas and that convenient layer of accumulated fat we call our Peruvian Padding. But swimming so high up does just again make it harder as all the oxygen made an exodus out of my body and then I had to run out of the lake because a horse was eating our mango. Put of a plastic bag an everything, the thief! The mango we bought for 1 boliviano (about 11p) so we were mightily pissed.\n\nFrom here we crossed back into Peru, which involved restraining G (or egging her on) from slapping a border official, and on to Puno on the northeast coast of Lake titicaca. A supremely ugly town, it was nevertheless a homecoming to be back in Peru, felt like a warm hug even if it was a new city. From here we could visit the Incan and pre-incan chullpas, or enormous funerary towers where royals and other VIPs were buried. Initially wasn't overenthused to see them but the site at Sillustani is featured on the special series of 1 sol coins so i don't think J would've allowed us back into the house in lima without visiting it (yes this is the man who went all the way to Huaraz, trekking capital of the country where you pretty much only go for hiking, to see one rock. because it was on a coin. Not even the original rock. It was a cool rock with a cool story, but still. Coins.)\n\nHad a tour for Sillustani in the afternoon, and we do enjoy getting tourist tours because its so EASY but it was a breath of fresh air to DIY it on public transport to another site of chullpas, Cutimbo. After cursing the lung-pummeling climb up onto a table top mountain we were greeted with the views across the high plain and had to concede it wasn't a half bad place to be buried. These towers are ridiculously enormous, 8 to 12 m looming like ancient grain silos containing something rather less pleasant than grain. Sadly they've all been raided and emptied long ago so no mummies or intact skeletons to see, but impressive in their scale nonetheless.\n\n(The site is also accompanied by what has to be the shittest museum in Peru, no questions there, it has about as much claim to being a museum as a pushbike does to being a Harley davidson)\n\nNext day we boated onto the lake to visit the floating reed islands of the Uros people, who hundreds of years ago got sick of the bickering on land and ran away to live on the water. Respect, I mean who's up for building a floating community off the coast of Britain????? Their whole lives revolve around these totora reeds, living on and in them, eating them, building houses and boats and crafts out of the stuff. It feels like walking on a trampoline, the spongy texture a result of constantly refreshing the island with fresh reeds while they rot from below.\n\nAfterwards it was on to Taquile (not Tequila thank god, we still haven't recovered from 1 sol shots on the trek), an almost Mediterranean island in the middle of the lake where you could not tell that the water had any end, you could be looking over the English channel with that distance. Again inhabited by an ancient culture, where the women spin wool and the men sit around in gorgeous suits all day knitting the finest most intricate wares. Island was pretty and all but Oh My Lord was the weaving and knitwear incredible. Got a bit obsessed and had to invest in traditional belts (worn by men, but whatever) to add to our ever-growing pile of clothes amassed in South america.\n\nYes we finally got our beach time, a few hundred kilometres from the actual coastline!\n\nNext time we continue north to see condors....\n\nByeeee!\n\nM + G\n"}, {"title": "16 Birthday Shenanigans", "date": "18-02-2020", "href": "/_pages/newsblogs/18-02-2020.html", "src": "/assets/img/in/16_m.jpg", "content": "Arequipa!\n\nYes we made it to the white city, though in rather less comfort than previous night buses since we ended up spending the night on the floor of the bus station because the seats all sloped downwards too much to lie on. The night buses have thus far been criminally comfortable, so that we've developed a Pavlovian response to the reclining chairs that we immediately conk out and can pretty much sleep through. Day buses are far less fun, cabin fever driving us up the wall as the bus drove us over the plains only made better by the chicharron ladies on the bus. Chicharron just means 'fried', fried what doesn't really matter, because god does it taste good.\n\nArequipa was a beautiful surprise, warm and sunny and metropolitan giving us the excuse to strip upon arrival and spend the day basking in the sun like Brits in Portugal instead of holed up inside a museum. From here did a two day trek into the colca canyon, second deepest canyon in the world (the deepest one is another 12 hrs away by coach - maybe next time) and twice the depth of the grand canyon. It's upper slopes are shallower and terraced like marbling, an immense knitted quilt of greens erupting out of the crevice. The lower canyon is more rugged, with walls of rock rising 4000m at its deepest where the clouds get trapped far below. Here we embarked, spending the first day walking down into the canyon, a complete inversion of everything I, a mountain climber, know to be true. Walk down first, then up??? Felt completely unearned to skip down the mountainside without having put in the work to climb first; it would have felt like a cheat code or flying eagle rescue were it not for the lingering knowledge we'd have to climb it all back up tomorrow morning.....\n\nSlept in a village right at the bottom of the canyon which just gives the impression of being in a deep valley when you're inside - couldn't quite wrap our heads around the concept that the landscape just carries on flat when you get to the top of the canyon instead of going back down on the other side, until you reach the top of the steep climb and realise the canyon is low instead of the mountains being high. Can't explain properly, but it's odd!\n\nThe clouds stacked themselves like cotton candy in the canyon the next morning somewhat obscuring our view as we hiked up (clouds! What a lovely change in scenery) but we did catch sight of a few condors, one flying close just to flaunt its ridiculous wingspan. The largest flying bird in the world, only about 40 remain in the wild .\n\nBack in Arequipa, we decided to go out (2nd feb - yes i know a bit behind with the emails) for my birthday because tomorrow was for the night bus and we wanted to loosen the shoelaces a little. Our hostel had a rooftop bar with a wonderful view over the city that nobody was looking at because the super bowl was on, but met some nice germans who weren't hypnotized by the (frankly incredible) amount of arse on the TV. We're honestly confused how there's any humans left in Germany because Every Single Person we've met travelling has been german, but we've got absolutely no problem with it except they're also all engineers. Also I've probably spoken more German than Spanish here...\n\nHad a great night letting loose, especially after we got latched onto a group of locals to bang rum shots on the street corner, yes very classy, and then it was on to the club where it was proven once and for all that we've been in this country far too long because we actively enjoyed the music. Since the beginning we've drawn a hard line at enjoying reggaeton, a genre of music that's far less fun than it sounds, dedicated to taking the worst of club and electronic music and giving it a thorough spin in the latin washing machine. Plus I'm pretty sure there's a contest for who can repeat the same lines the most times during one song. Its awful, and awfully popular, but awful music that's popular usually still has a beat, so yes we have finally been peruvianised and can not only dance to, but enjoy, reggaeton! Que pena.\n\nSo yes dancing was good with a lil help from our friend Ron, therefore the next day was spent in a state of disrepair and rampant spending which is totally ok because you only turn 20 once but also not ok because the last two weeks have been \"ahh it's M's birthday let's treat ourselves\" and the amount of money spent on food and taxis has increased exponentially. We nursed the hangovers with KFC (v fancy birthday meal I know) that tasted much better than it was allowed to, and a visit to Santa Catalina the sprawling citadelic 17th century monastery in the colonial centre. At first it felt rather blasphemous wandering round this grand important religious centre with a headache like a woodpecker and the faint whiff of alcohol trailing behind us, but I'll say this now: big old quiet dark buildings adorned with paintings of dead nuns* where they play you choral music are really remarkably pleasant after a night of doing shots on the street like teenagers (one of which I officially no longer am). The monastery is so big it has it's own pattern of streets to get lost in so it served as an excellent escape from the bustle of central arequipa.\n\nFrom here we night bussed it to nazca, final stop before lima, where the wall of heat hit us like a drunk taxi driving onto the pavement (depressingly common in Peru). The main attraction here are the nazca lines, immense geoglyphs carved into the desert around 2000 years ago by the nazca civilisation. They're suuuper cool, creatures like monkeys and birds and and astronaut (?), but seeing them properly requires getting into what is essentially a toy plane. Thought nothing of it, couldn't wait to clamber into the 6-seater to get up high and see the lines, but it started to go a little bit south when the pilot banked around the first figure so you could see the line from the other side of the plane. Hhmmmmmmmm.\n\nI think it's sufficient to say there are about 15 shapes on the route, which amounts to an organ-loosening amount of swerving and banking until I was just a sack of skin vaguely holding in Intestine Smoothie (the latest health food trend). I get motion sickness pretty easily so I should've seen it coming, but it was a surprise to turn round and see Gemma in the same state of liquidness.\n\nWe stumbled out of the plane like newborn giraffes and couldn't function as human beans for the next few hours so instead of doing more tourist stuff we treated ourselves to a pool for the rest of the day :))) An early night refastened our innards so we set off for chauchilla, an open cemetery from the nazca civilisation who were the only pre-colombians to mummify their entire population. They also beheaded them, and left them with their kilometre long dreadlocks which with their headbands gave the impression of walking around in a Gary Larson cartoon about hippie headhunters.\n\nFrom here it was finally back to lima, which we were really looking forward to after spending so long away and on the move and with ridiculously heavy backpacks. It did feel weird visiting so much in so little time after having the luxury of time in iquitos and cusco but we get why other travellers do everything so quickly and jam-packed - it's thrilling to be experiencing so much so rapidly, so many changes of landscape and culture.\n\nBut happy to return to lima! Missed you.\n\nByeeeeee!\n\nMereida\n\n\n\n* this is weirder than it sounds, the nuns weren't allowed to be painted while they were living so painters had 24hrs after their deaths to immortalise them on canvas, often in their coffin garb and looking, well, pale as death.\n\n"}, {"title": "17 Tumbes and Tumbas", "date": "07-03-2020", "href": "/_pages/newsblogs/07-03-2020.html", "src": "/assets/img/in/17_m.jpg", "content": "Holaaaa, it's been a few weeks so gotta play catch up, we've left lima and returned all in this time.\n\nYes after a few months away we finally made it back to lima, back to Tupac which welcomed us with open arms and a showering of 1 sol sandwiches (so what if the main cause of our lima excitement is cheap food). Immediately we were happy, not just to be home and dump all the heavy shit that's been accumulating in our backpacks like a glacial moraine (?) but because it's SUMMER!! My impression of lima in October was one of perpetual greyness, not a heavy grey pile London but just this vast open flatness like a persistent layer of dust. But my oh my, the sun really does the city some favours,  flip flops and marcianos (ice lollies) out in full force, so we hit the beach straight away with J to try his new hobby - windsurfing. Yep, he's bought a board and is getting lessons on the chorrillos beachfront, which is great except he gets to learn on an easy board while we had to struggle along on his much more difficult pro board which weighs about as much as a whole Peruvian family on a motorbike. Couldn't even lift the damn sail the first time, but we did improve markedly despite attracting the interest of a myriad jellyfish big enough to wear as a helmet, and now we can (kinda kinda) windsurf!\n\nWould've been sad to leave the sun and beaches of lima had we not been going north for more of the same, cruising down the coast picking up monster tans and a platano chip addiction (crisps made of fried banana - heaven) along the way. Yes we finally finally made it up to Tumbes, a plan we'd had pretty much since arriving in Peru but that never quite materialised. I mean it is right at the top end of the country, 25 mins from Ecuador, and our desire to see this rather untouristy of destinations was based almost solely on the Tumbes Crocodile, predictably depicted on a coin...... Had a nice relaxed time in the heat of the north, the air dripping in humidity like the trees that drip with flowers. There is a determined beauty to the grime of the town, sweaty and packed without ever being claustrophobic, aided by the kitch mosaics that bulge from many walls. (3D relief mosaics! What an idea!) My favourite detail by far has to be the big mosaic mural display at the head of the plaza, flanked by a huge broadband billboard advertising Tumbes and showing in the photo, you guessed it, that very same display. Like seeing double but just more stupid.\n\nFrom here we went on the nicest, loveliest tour, with an agency run by this family and the whole family baby and all accompanied us on this trip (dad guide and baby holder; mum driver; son the muscle; baby cute distraction). We ended up feeling like we'd gotten to tag along on the Sunday family outing, involving fruit picking, mud bathing and hunting for fossilized wood in the Jurassic park of Cerro Amotape, which even comes with its own pterodactyls! Or anyway they really looked like pterodactyls, not sure the Peruvian government has actually succeeded in bringing them back to life.\n\nFrom there it was on to Mancora, beach capital of Peru or 'home of the hangover' as it may better be called. We checked in to a beach resort hostel for the party and the pool, receiving neither as it turned out to be pretty lowkey and WE WERENT ALLOWED IN THE POOL AT NIGHT. Absolute travesty. But we hit the bar regardless and it turned into a really fun night dancing with other tourists and locals, and we were rather relieved to have a chill hostel to return to and a pool to swim off the hangover in the morning. In fact, I don't think we made it out of the pool before midday, at which point we gently transferred ourselves to the beach 10m away to be repeatedly pummelled by the ocean. Mancora is famous for its waves, smooth rolling sea monsters cruising along its endless beach, which might provide easy surfing but dealt us a real workout in trying to stay afloat. Nothing like a repetitive slap in the face from a wave, like the most sadistic metronome, to clear a hangover.\n\nThe subsequent night and day followed the same pattern, though we upped our game by trying to learn to flip into the pool (Not Recommended For The Cripplingly Hungover) leaving me with a smattering of bruises down my back. And finally, on our last evening we managed to slip in a nighttime swim in the inky Pacific, occasionally being consumed by waves that crept up on us in the darkness, only noticing them if they crested like a white crown glinting in the night. These waves gave us our best gift yet - bioluminescense, drifting like grains of glitter on the sea foam, coalescing into shadows of light behind your hand passing through the water. A perfect goodbye from the ocean.\n\nWe night bussed it to Chiclayo, our final stop before heading inland to iquitos where we only planned to spend one day but we didn't read the guidebook closely enough - museums here are closed on Mondays! So a day turned into two, giving us the chance to crash and unfurl before our archaeological tour to the best fucking museum in Peru. The Museo Tumbas Reales de Sipan is a relatively new addition to the Peruvian museum roster, but a valuable one: collecting the wealth from Moche tumbas (tombs) that remained completely unraided until their discovery in the 80s, meaning for once you get to see all the gold and craftsmanship that escaped the looting of locals and the rampant melting the Spanish so loved to indulge. Gemma the magpie was transported to seventh heaven, but even I learned to appreciate the allure of gold in these exquisitely crafted forms, jewellery and armour, headdresses and tools, decorated with precious stones and carvings and embossing, all tucked away with buried kings and protected in their soil prisons from prying fingers. A tiny glimpse into the vast ancient wealth of just one of Peru's countless civilisations, a tantalising taste of what was, and what was destroyed.\n\nAlright, enough for now, next time we head back into the amazon for some monkey business....\n\nByeeeeeee!\n\nMereida\n"}, {"title": "18 In the Ama-zone", "date": "13-03-2020", "href": "/_pages/newsblogs/13-03-2020.html", "src": "/assets/img/in/18_m.jpg", "content": "Booooooooaaaaaaaaaaaaaaat\n\nDiiiiiiiiiiiiiiiiiiiiirrrrrrrrrrrrrrrrrrrrrrrrrrrt\n\nHaaaaammmmmmmmoooooooooccccckk\n\nGrrrrriiiiìiiiiiiijjjjjiiiiiiiiimmmmmmmmeeeeeeeee\n\nYep we got a boat down the Amazon, though first this involved the cripplingly long bus journey inland from Chiclayo to Tarapoto, followed by a taxi to Yurimaguas on what is undoubtedly the most jaw-dropping road in Peru. Winding up and through the cloud forests, great slabs of mountain blanketed in rainforest, the jungle drooping over one side of the road while the mountainside just falls away on the other. It was absolutely stunning, and I couldn't look at the landscape for any of it because I was completely and utterly carsick. Had to stare at the road the entire time we were driving through this wonderland of mountain and jungle, and G suffered the same fate until we were actively glad to be out of the mountains. Never thought i'd be saying that....\n\nLast time, we flew both to and from Iquitos (inaccessible by road) so when Matty booked his flight to visit us here we jumped at the chance to catch the boat. Ended up on a pretty small, two-tiered transportation boat, small enough that they couldn't keep a KFC's worth of chickens on it, thank god. Then again after two nights and two days I did get serious cabin fever from the lack of space, which is ironic since nobody had cabins but just slept in the spiderweb of hammocks. The web was so dense I was sleeping on top of someone else, and you could barely walk for the sheer mass of hammocked humans in your way. Then again there was a definite thrill to this very local mode of transport, surrounded by families with 5 children (all of whom remained impressively quiet), a nun, ladies with their dogs in the hammock, one ballsy dude helping his ancient mother-in-law while wearing a pornstar t-shirt, and all these Peruvians to whom we served as on-board entertainment for the whole trip. There were a handful of other tourists too who we ended up hanging out with for the week, two Aussies chantelle and Angus the prophet-without-a-mission, Norman the lovely sweet Belgian and another german, Fabian the drug-and-family enthusiast.\n\nIt was very hot on the boat, and very sticky, not helped by already being covered in grime from the night bus, and soon we were no longer sad about not being on the boat for longer... My romantic idea of dangling in my hammock on the water for days on end was tempered by the extreme heat, lack of hygiene and lack of water until I felt stickier than if you'd bathed me in juice. But it was all worth it for that Boat Feeling, out on the wide river playing host to a dazzling light show at sunset, and then the emergence of a starry sky like no other. The tapestry of light just kept getting brighter against the vantablack of the unpolluted sky, and it's a very weird feeling to be moving and turning on a boat while staring up, kinda like a personal planetarium display. Incredible.\n\nArrived in iquitos in the evening, happy to be back in the polluted tropical air and looking forward to actually spending some time in the city this time :) . After showering enough to remove three layers of skin we picked up Matty at the airport with his requested sign (cut out of toilet paper - what a diva). Grabbed some midnight dinner and suddenly tragedy struck - an hour after arriving, mattys fanny pack containing all his credit cards, cash and hearing aid batteries (!) was snatched clean off the table by a dude who leapt onto a motorbike and was off into the night. What a welcome to Peru. G and I haven't encountered anything of the sort in all our 5 months here so we were in shock too, and it did put a damper on the night though Matty took it remarkable well.\n\nTook a chill day the next day, heading to an lake warmer than most of my baths, and though we couldn't swim far out into the lake we were quite glad for the net surrounding the designated bathing area after glimpsing the paiche, a prehistoric sea monster of a fish large enough to inspire a thousand legends, in the adjacent animal reserve. On the bus back we were taken rather by surprise when a water balloon came sailing in through the bus window, exploding in Gemmas face, though what was more surprising was the utter lack of reaction from anybody in the bus even though half the passengers got soaked. It took a second shower for us to clock there must be something going on, which we later found out was Carnaval!!! from Peruvian Nacho Libre, our friend who works at the nice hotel. Perfect timing Matty, we had no idea this water-fight tupperware festival (yes it's as random as it sounds) was taking place this weekend.\n\nGot rather sloshed on round after round of beer with our hotel friend before going out with the guys from the boat for a night of dancing and being covered in flour (carnaval tradition), which required a day of Pool afterwards to recover before real carnaval night on Sunday. The smaller, odder sibling to rio's carnaval, the day was spent avoiding buckets of water, paint, clay or if you're unlucky worse things, being hurled at tricycles by entire families set up outside their homes with paddling pools and lots of buckets. What a tremendous family activity. The main fiestas take place around huge trees, strung full of balloons and Tupperware and erected around town to be ceremonially cut down at the end of the night. We hit one such street party, devoid of any belongings because everyone got so repeatedly soaked and covered in paint one could have irrigated a small farm with the amount of water thrown. At the cutting of the tree, I was even fast enough to nab an orange plastic bowl, which I promptly broke. :(\n\nThe rest of the night was spent in pursuit of music and dancing, until once again everyone was completely fucked the next morning though the three of us did manage a jaunt to Belén Market to ogle the dead crocodiles and armadillos. And then finally it was off on our jungle tour! Four days, the whole boat crew, off into the jungle to spot some wildlife. Spent the first two nights in stilted wooden shacks on the riverside a few hours from iquitos, comfortable but with some obvious design flaws in regards to mosquito-proofing: why take care to seal every edge of mosquito net when you leave a massive freaking gap across one side of the room?!? Also, the toilet may have been en-suite but was left utterly at the mercy of the mosquitos, so on every extended trip to the loo you stayed thoroughly entertained trying to keep the little buggers off your bare bum.\n\nAlternately trekking through the jungle (getting rather lost) or skimming the waterways in the canoe, both by day and night (when the caimans come out ~ oooh spooky), we got to see so much wildlife, so much, so here's an abridged rundown:\n\nPink river dolphins which look about as similar to normal dolphins as sausage dogs do to greyhounds; canopies crawling with capuchins; all manner of birdlife from humble little woodpeckers to the imposing glare of osprey hawks and red-headed vultures; kingfishers the size (and shape) of rugby balls; one enormous snake; so many more monkeys from giant red woolleys to the tiny night monkey keeping watch in his tree hole; sloths; scarlett macaws like Chinese dragons unfurling into an explosion of colour; a scampering iguana; many a mozzie;\nthe unsettling glint of caiman eyes in the night; then, the rather less mysterious, more stomach-churning corpses of caimans hunted by the locals, slit open in extravagant fashion for yours truly........ and one very cheeky spider monkey who boarded our boat and then wouldn't let go of Angus's thigh without crying us a river (who also kissed my knee! I fell in love on the spot, the creature had eyes you could tumble into).\n\nSo yes our time in the jungle was hugely rewarding, not just for the animals but for being enveloped again in those towering trees, everything a surreal shade of green. Walking, I had the perpetual feeling of being inside a nature documentary but being somehow glued to the ground - I craved to soar over the canopy, ascend through the leaves like a camera can. I suppose this is the feeling of snorkelling once you learn the joy of diving, because it was still immensely enjoyable, just trudging through the jungle, a spectator to mother nature.\n\nEven got to taste the suri, not the mini ostrich but the local delicacy that is the larvae of the palm weevil like a huge pale maggot the size of my little finger. Served grilled in the market, they are apparently edible raw - and more importantly, aliiiive - so papa to make you proud I tried this thing!!!! I felt like simba in the lion king gulping down the huge grubs, except you're meant to bite down on them as quickly as possible and they explode into juice in your mouth. The taste wasn't anything strong, but GOD the bursting bug felt horrendous, a rather less appetizing popping boba in the world's worst bubble tea. Hope I did you proud paps.\n\nOn the third evening we headed up the river to a network of lakes beautiful enough to trick you into into believing the natural world remains perfect; alternately embellished with greener-than-green plant life or completely unblemished, chic mirrors reflecting the frowning boughs of the forest. Here we pitched camp, before fishing for piranhas (gem caught one! It's freakishly hard they are very good at chomping the bait clean off the hook) and then taking the most luxurious sunset swim in those same piranha-and-caiman waters. It was glorious! Though after a few days of crippling heat and sitting on wooden benches until the boys practically eroded their arse bones, I wasn't salty about heading back to the city. And yes the mozzies were on extra top form, though we were fortunate to be with Norman such a tasty belgian who attracted the brunt of the swarms and left the jungle with more bite than plain skin...\n\nBack in iquitos everyone was pretty run down though all still went out, except me who indulged in a proper good long nights sleep, and then we bid goodbye to the boat crew which was honestly really sad because it's the longest we've gotten to hang out with people properly. Like always being on the move is great, but people flit in and out of your life without you ever getting to make the most of new friendships. So then we were three, and headed back to the jungle house from last time for a few chill days of Hammock Time. After a pulse-raising bus ride in which the bus we were on tried to catch up with the bus we were meant to be on down a few kilometres of cluttered iquitos road, it was so nice and comforting to walk the long (long, long) path back to the house. We found the house rather packed with people and also set up much more nicely than we managed in a month of living there (sheepish glance) but it was exactly what I needed to relax, drifting in and out of sleep for a whole day and only getting out of the hammock about 3 times to eat and piss. Absolute luxury.\n\nAnother improvement was the complete lack of a) cockroaches and b) mosquitos, meaning we could spend the entire day dawn til dusk outside in the forest without getting bitten once! Last time we tried super hard but always had to concede to the Might of the Mosquito barely an hour after going outside, so I have no idea why they suddenly fucked off. It was wonderful though, lying undressed on the forest floor watching the breeze tease the treetops, eating cacao pods (new fave froot) straight off the tree and listening to the familiar sounds of the jungle when Matty didn't have music on his speaker. Oh god I have missed listening to normal music that isn't reggaeton or cumbia thank you so much Matty.\n\nUnfortunately only had a few days to indulge in the languid Eden of the house, because on our last day we had to hit the pool at the same hotel from before because pooool. Tragedy struck again though when, night having fallen, a bat crashed into my forehead and then clung onto Gemmas arm so I tried to grab her phone to look at it and accidentally elbowed it into the pool. Shit! It's bad, very bad, but i suppose it was time for me to break someone else's phone seeing as I've broken enough of my own. Sorry gemma. Good timing though, as phone went home with Matty while we flew back to the dry summer heat of lima.\n\nSo, that's goodbye iquitos, place we've spent the most time apart from lima and I'm very glad it is so because I love this mad city with it's crazy markets and thick air and armies of tricycles. The tricycle thing is such a luxury, don't think we walked anywhere this time, not when it's so cheap (3 soles) just to jump in a mototaxi that'll take you right to the door or wherever you're going. We probably got 6 or 7 a day, and even more on nights out because it's so easy!!! And I'm glad we had so much jungle time, the constant symphony lulling us to sleep while eagles soar overhead. But, I'm ready to go. Am yearning for the Andes again, to be up high in the barren wilderness with the wind whipping round my legs. I've got horizontigo, and after over a month in broiling heat I've completely forgotten what it feels like to be cold. So, Amazon, you've served us excellently and I've loved every minute, but it's time I get back to my mountains.\n\nForever an Amazonian,\n\nMereida\n\n\n\n"}, {"title": "19 Solo Han Solo", "date": "28-03-2020", "href": "/_pages/newsblogs/28-03-2020.html", "src": "/assets/img/in/19_m.jpg", "content": "Hey! Hope everyone is holding up alright, our entire reality has changed since I last wrote.  *Current status* quarantined safely in lima,  been in full military lockdown for two weeks so just sitting tight waiting for the UK government to haul ass over here and come get us. Enjoying sun and what beer there is left in the city.\n\nBut here's a distraction from the constant parliamentary updates and corona memes - My last week on the road in Peru!\n\n\n\nThe breaking of the fellowship - attack of the dogs - laguna cheerup - a farewell to arms(trength) - Santa cruise - it's fucking cold - paramount pictures - let's play pandemic\n\n\nYep after 5 months travelling with gemma in what I have to say has been a very fitting and productive partnership, it was finally time to start my solo career! Not that it was creative differences that split the band, I'm just not used to being around humans so consisistently for so long and honestly I'm impressed by how long we both lasted. But the last couple of weeks hanging out with so many people begun to take their toll, so immediately after arriving back in Lima I set off again in pursuit of mountains. I just wanted to get away, mostly from the puppy that's taken residence in J's house who has a tendency to regard mereidas belongings (and toes!) as her own banquet and CHEWS ALL MY STUFF. If I wanted all my shit to be chewed I'd bloody well do it myself.\n\nHeaded first to huanuco, a classic central Andean city with not much to offer me but a pile of rocks claiming to be an ancient temple and the nicest taxi driver money could buy (if not the most intact vehicle). From here I quickly moved on to La Union, a teeny town with better mountain access an eventful colectivo ride away from huanuco. Colectivos are informal public transport, shared taxis that plough the smaller transit routes usually stuffed full of passengers and stacked high with bits n bobs that they force you into to fill up and start driving. One dude practically lifted me out of one taxi through the window to throw me into the colectivo. What gentlemen.\n\nFelt good to finally be travelling alone - there's a comfort and ease to travelling together, and a pure joy in sharing profound and beautiful experiences with someone you love, never having to explain anything and often moving in symbiosis or as a single organism, but I felt so ready to go it alone. Met so many other tourists who really enjoyed travelling alone, and though i wouldn't have been able to do it at the beginning of the trip I now feel at home in Peru and in the traveller lifestyle, refreshed to be starting my own adventure. La union turned out to be a rather unremarkable, completely untouristy town which suited my needs perfectly, avoiding speaking English for a good 3 days and blending in to the local populace as much as my uncatholic clothes would allow.\n\nOn my second day alone I headed up the mountain path to huanuco pampa, the incan ruins on top of the plains above la union. Well that was the plan, as I hit the deserted trail with the mountain all to myself for a lung-pummeling first acclimatisation hike in preparation for my upcoming trek. Felt good to have the mountain to myself, save for the odd llama farmer (stay calmer if you want to harm a llama call a llama farmer) but the exhilaration of reaching the plain was short lived when I was suddenly attacked by three stray dogs. They came out of nowhere, and being a flat plain there was nowhere to go. This happens a lot in Peru, aggressive gangs of strays, but they usually back off if you stand up to them. It helps being in a group, so I was pretty angry this occurred on my first trip out alone! It was terrifying, the dogs surrounding me growling and jabbing at me and I couldn't face all three until two went straight for my legs, taking one each in their jaws . By this point I was screaming and crying, legs burning and bleeding and not a soul around. Sorry but in some situations mountains just aren't enough. Eventually a little girl turned up, called off the dogs in an unreassuringly apathetic tone and was absolutely no help to my plight. Legged it down the mountain in tears into the arms of the teeny tiniest old lady who tried to wash the wounds and took me to a pharmacy.\n\nSo yeah I didn't make it to Huanuco Viejo, instead I made it to the hospital, just a shack really, but it was an adventure. Currently working on not being scared of dogs, and decided to move on quickly the next day to Huaraz. When i arrived in thr bus, I realised with a slightly sinking heart that it was still clouds galore (the motive behind coming as late as possible in the trip was to avoid view blockages like clouds) but what a galore it was: even Turner would have had a mission painting the metropolis of clouds stacked in the valleys and up the slopes, towers and palaces in brilliant white against the bright blue. Huaraz had been slightly disappointing when we came in autumn, but I surprised myself with how happy I was to be back, watching the sunset burn across the sky from our rooftop kitchen. Everyone in the hostel was lovely and I felt in a truly happy place to be back :)\n\nNext day, first hike was up 4500m to the stunning Laguna Churup, just one of the many cosmic blue glacial lakes polkadotting the Cordillera Blanca. Was fortunate to meet a superb hiking partner in the colectivo up, a mad french canadian from the gun-toting backwoods of quebec named oliver who pushed me up the steep path in an acclimatisation sprint that transformed my lungs into prunes. Rewarded myself with an invigorating swim at the top that threatened to turn me into an amputee, but I couldn't resist the pull of the icy azul water! Not gonna bother describing the views because it's beyond my linguistic skills to be honest.\n\nThe following day I embarked on some proper climbing with a local guide to give the thighs a break. Been constantly fantasizing about hitting the walls since enveloping myself in the Andes, but one warm-up climb quickly reminded me why I tend to hike up mountains instead of climbing straight up the rock faces. The strength drained out of my arms as blood from a haemophiliac and the gritty rock proved a sharp (!) contrast to the positively soft hand holds you get on a sport wall so I came away from the rock peeling skin off my hands like latex gloves. But it was exhilarating, cresting the top of the walls in triumph (cheated quite a bit on the way up...) only to be rewarded with the most jaw-dropping views across the valley to the Cordillera Blanca's snow-frosted peaks winking in the morning sun.\n\nWas thoroughly deaded after climbing, more utterly exhausted than I felt in a long time so much it hurt even just to lie still. Nevertheless managed to schlep my corpse to the internet cafe, a cesspool of sweat and testosterone where young males congregate to generate dopamine by shooting at each other. It's also pitch black, so I oriented myself by the glow of video games to a computer where I could edit a comic submission, soundtracked by urban grunts telegraphing the successes and losses dotted around the room. It was less stressful than that may sound.\n\nFor my final acclimatisation hike I did the revered Laguna 69 that everyone in Huaraz doesn't shut up about. The lake itself is not THAT stunning (though by general global standards still a knockout- I'm just a lil bit spoilt here) but with views across the Nevado Huáscaran (Peru's highest mountain) and the surrounding landscape enough to stop you in your tracks. This happened frequently on the hike up so I kept holding up the people behind to stop and admire Middle Earth despite the descending clouds. Ended up hanging out at the lake with some other hikers for a few hours, waiting juuuuust long enough for the clouds to lift and unveil the surrounding glaciers dropping into the lake before the sunny descent back down. Worth it!\n\nAnd then.... trek time!!! Finally embarked on the Santa Cruz trek which was the plan since our first jaunt to Huaraz in November. G was meant to join me but was blissfully happy to be on my own too, and got thrown in with a banging group for 3 freezing nights and four glorious days. The walking wasn't particularly demanding, but despite having acclimatised and not having to carry heavy bags, the altitudes made sure we were all breathing hard and getting a proper workout.\n\nBegan the trek at about 3600, though not before one of the locals in the village informed us the borders were closing on Monday (it was Friday, but we didn't know how serious the rumour would turn out to be...). The walk took us through a quaint emerald valley, weaving in and out of the shadows of dramatic peaks looming above the clouds. The first camp was pitched on a marsh which just screamed of bad planning but in fairness the view was gorgeous, we caught the last of the afternoon sun and only one member of the group actually put their foot in it. The is the first trek I've done here (or I think ever in the mountains!) where it's full-blooded camping, not just huts or something, which excited me but also terrified because I know myself and I do NOT sleep well in a tent. I just don't, I always need to pee in the middle of the night regardless of how little I've drunk or how much I've already pissed. Tent-Induced Incontinence, it's a real disorder, might start a charity.\n\nThe next day we ascended the Punta Union pass, touted as the toughest part of the trek with the best view. Set off in the early morning mist which somehow never got it together to fuck off.... I'm telling you, it's a lot less rewarding to climb all the way up to 4800 with no view, praying the clouds will shift when you reach the top, wheezing and dragging yourself up the slabs or rock imagining the sun breaking through just as you crest the...\nNope didn't budge, real shame and absolute endorphin robbage. Enjoyed it regardless and settled down on the plain below the pass for our second camping spot, wrapped in a 360 panorama of snow-frosted, razor-sharp peaks. As evening wore on they emerged like forest nymphs at twilight, until night fell to a black sky illuminated by the snow reflecting the starlight.\n\nIt was only these silver peaks in the night that managed to yank me out of bed to piss, because BOY was it cold. The first night was cold for sure but here we were higher again (4200) and I obviously missed a trick when packing in lima where it is currently WARM and SUNNY and good Lord I forgot what it feels like to be really, truly, bone-chillingly, fertility-destroyingly cold. Suffice to say sleep was not on the menu that night, so it's great the next day was by far the longest and most exhausting! Yay!\n\nReally though, day 3 was breathtaking from start to finish, and not just because of the altitude. We detoured to a cobalt glacial lake under Alpamayo, perched high in its little dip and screened all round by sheer rock walls with a huge freaking glacier right in front of us just dropping into the water. Couldn't resist a swim in the early sunlight, and we had a good long time just to bask and pose precariously and sing happy birthday in 6 or 7 languages before the long and dusty descent watched over by the perfect cone of the paramount pictures mountain. Just a dreamy day, running down the mountain and traipsing for hours through the valley over the dried lake bed, the colours changing from white to blue to green to golden brown, slowly darkening as we progressed through the valley. The icy peaks didn't cease either, though we never did glimpse the eponymous Santa Cruz.....\n\nIt felt so good to walk alone, indulging my own thoughts and languishing in the pleasant emptiness of my head. Fortunately or unfortunately, I found a beautiful intact and well-preserved cow skull which of course I had to bring home for Gemma because it's pristine and glorious and Heavy As Shit, nearly ripped my arms out of their sockets tryna carry that thing down the mountain. Did grow a bit attached though, he's named Joseph and slept in my tent much to the chagrin of my tentmate... after 8 hrs of walking I was rather deaded and slept like a milked-up baby :) finally.\n\nThe views and the walking were pretty exhilarating, but best bit was almost sitting in the big tent in the evenings with everyone, warding off the cold with stories and jokes and coronavirus conspiracy theories. I love getting to know people from such varied backgrounds - obviously we all come from lifestyles with enough wealth to travel for leisure, but here we were, 8 people 5 countries 3 ex-military (Israeli and korean armies!) and 1 rabid cheese-lover. Hint: not me. It was a luxury to spend the days of the virus escalation in blissful mountainous ignorance, with this wonderful group joking our way through the uncertainty.\n\nI think I'll leave it at that, we've heard and thought and talked enough about the virus for now. I leave you, hunched in a tent surrounded by cows and rugged peaks, warming our hands by the light of a single candle.\n\n\n\nMereida\n\n\n"}, {"title": "20 Lockdown", "date": "05-04-2020", "href": "/_pages/newsblogs/05-04-2020.html", "src": "/assets/img/in/20_m.jpg", "content": "Coronavirus strikes!\n\n\nLife n death - 24 hours of hell - the langoliers - the north-south divide - tupac - tuuuuuuppaaaaaaac -\n\n\nSo, where were we? Ah yes, sitting deep in the mountains with my cow skull and without a care in the world, gearing ourselves up for the virus news when we finally reached civilisation again. The last day of the trek was fittingly gorgeous and I sneaked in a sneaky dip in the river before reaching the final stop around 10am. The bird-life was out in full force, think (think!) I saw a condor up high. Also crossed paths with an enormous tarantula, and, initial freak-out aside, behaved in a collected and calm manner to observe the creature until it disappeared. Progress!\n\nThat was, for the coming time, our last slice of bliss. The moment we reached the checkpoint, phones were whipped out, data switched on and........... yep the world was on fire, what else new? We knew the situation was bad internationally, and seems the Peruvian president knew it too because in the intervening time he'd announced not only the full closure of borders to Peruvians and to foreigners, effectively trapping us in the country, but to aid that, the shutdown of all airports AND - here the real kick in the nuts - banned the movement of all people within the country too. This was announced Sunday, giving people one day (Monday 16th) to get out the country and to travel between cities (and indeed within them) with the military moving in Monday night.\n\nThe great thing about being in Peru for the whole development of the virus was that it was so far removed from everything. G and I first heard about it in January in cusco, but it was this little thing circulating China about as far from south America as you can get . It was mentioned in the news, including this beaoutiful newspaper cover image of a Chinese dragon in a face mask with its claws wrapped around the earth, but aside from my dad not being able to talk about ANYTHING else on the phone (for which I even chastised him greatly) we didn't expect it to disrupt our trip much. We lived in cocky ignorance and fuck yeah was it nice. We watched in detached horror as the disease took Italy, then Spain, slaughtering its way across europe like Genghis Khan's army, creeping towards Britain and indeed towards us. Then, beginning of March, it finally breached the Atlantic and landed in Brazil, the invisible twin to the conquistadors 500 years earlier, yet we had only an inkling of how quickly it would spread.\n\nSo there we were, Monday morning, sitting in a tiny town in the mountains while everything collapsed around us. Had a nightmare 24hrs getting back to lima: 3hrs on a bumpy bus back to the town of Huaraz, trying to find a bus, any bus, to take us back to lima after everyone's initial tickets got cancelled. The streets of Huaraz were eerily quiet and empty, something that just doesn't happen in Peru - everyone is always out on the street trying to sell you something, but suddenly shopfronts were closed and cars no longer driving on the roads. I was sorely, sorely tempted to stay in Huaraz for the 15-day quarantine, hanging out in the hostel with all these other tourists; even if we couldn't go out the views of the mountains would make it ok. There was even this very sweet cherub who straight up propositioned me in the hallway, because when the world is ending you might as well go for it, no? I mean I didn't, but it's nice to know some things carry on like normal. So yeah, I didn't want to return to the dust and heat of lima, the claustrophobia of the (admittedly big) house, whose only redeeming quality is the proximity to the now-inaccessible beach. But the smart choice was to return, try to catch the first flight out, which seemed less and less like it would be possible...\n\nDid manage to catch the last coach to lima with most of the group, now dubbed 'Team Escape Peru', carrying the frankly ridiculously enormous cow skull in my backpack (with the two horns sticking out either side) through multiple police checks. Arriving in lima in the dawning hours was eerie and unsettling, the city I now knew so well reduced to an echo of its former self. There were still people on the streets waiting for buses but everyone looked uncomfortable and desperate to get home. We were yet to see them, but we knew the military had invaded the centre of town making my journey from the bus terminal in the north to the house far in the south a rather fraught one.\n\nHeaded to the airport with the Israelis first, in one of the few, few taxis still operational (the ban on movement extended to driving) to scout for any plane, but it was completely locked up, empty, lifeless, like I'd stepped into Stephen king's The Langoliers (our new favourite story). Though there it ends with them escaping from time-eating monsters in a plane and here it ended with us being interviewed by Peruvian newsstations and running away from the military patrol. So then it was time to make my way south, bidding goodbye to the beautiful israelis who were picked up in private plans like pop stars by their government two days later anyway, and began to scout for a bus or taxi to take me home.\n\nI felt alright being alone since I'd become comfortable in the city, but nevertheless with the police and military everywhere there was a current of unease coursing through the streets. Finally found a taxi to take me all the way, past several police blocks, army tanks and enough rifles to supply the NRA, but I made it home safe n sound n so freaking relieved, exactly 24hrs after finishing the trek. It was so nice to see G and J and C again, though I have to say I was rather less enthused on reacquainting myself with the puppy. I just read that bit back and realised I referred to the house in tupac as 'home' at the end of the previous paragraph, that tells you everything I suppose!\n\nI am so grateful to have had them all, to have been able to live there in comfortable roomy bliss for the quarantine while everyone else was cramped in hostels and 10 person dormitories in the centre of town where you were barely allowed outside. Because here's the kicker: I really fucking enjoyed lockdown in lima. The military presences in our area wasn't strong, we still had something resembling a market, a huge house with a roof and a view that in any situation would be stunning, enough space for everyone.... And I have to say lima really stepped up for the whole lockdown thing. It is a fact universally acknowledged that, in tupac, we won't have water from about 3pm onwards. This was a source of stress for me at the beginning but you learn to cope, storing water and just hacking the smell of the sink because you can't wash up. I liked to complain about it a lot at first, but it was only really a problem when we'd go to the beach and have to walk around like sticky sand monsters all evening. Then suddenly, as soon as lockdown hit, un milagro! Water all day! Showers in the evening! Doing dishes after dinner!\n\nDespite being stuck here, I have to express my admiration for the Peruvian government. After 5 months of trash-talking them, we got to experience first-hand How to Efficiently Tackle a Crisis. They knew they don't have the resources to handle a full scale outbreak, so instead they shut down the country; to the detriment of the economy and many people's livelihoods, to save their lives. They could've given a biiiit more notice, but I commend them for taking action when other governments *cough* Boris *cough* wouldn't.\n\nOk this entire letter covers about 2 days in total lol. But I do think it's important to get a flavour for how the situation is in other countries, what other governments are doing to protect their people. Anyway. Will write more soon as am doing literally nothing else. Such fun.\n\nYours in safety and in health\n\nMereida\n\n\n\n\n"}, {"title": "21 stranded in a desert city", "date": "10-04-2020", "href": "/_pages/newsblogs/10-04-2020.html", "src": "/assets/img/in/21_m.jpg", "content": "Bliss\n\n\n\nIt feels weird writing this now that I'm home, especially since it's mostly for you parents who are currently in the same room as me, but I feel the memories of peru already slipping from my fingers as I try to grabs those wisps of recollection. It feels like attempting to scoop up water with a sieve when all I should be doing is plunging the sieve into the water, but that's getting harder and harder the longer I'm here.\n\nBut though I'm back, this story isn't finished yet so I'm doing my best to look back over my shoulder and articulate what I see.\n\nLockdown in lima was a weird little bubble of time: Peru itself was a bubble, somehow unfurling on a detached timeline of its own, away from the hustle and bustle of daily life, and here was a gift in the form of (an as yet unspecified amount of) time again removed from that to just Exist. After life on the move, constantly active seeing and doing and experiencing things (even if we did take a good few days of rest - but then again so did god) I unknowingly required time for being. At first, was certainly miffed about being stuck indoors in lima in midsummer; the prospect of two extra weeks in Peru would not have loomed so dark were we able still to travel within the country. Believe it or not, i've been here 6 months and Still not been everywhere i want to visit. But quickly we settled into lockdown life, becoming accustomed to the military patrols with their casual rifles and wearing a mask around the much shrunken market, only an echo of its former self. I nabbed myself a room in the house, strung up my jungle hammock, and accepted the new way of life.\n\nThe house, that blessed house, so big and dusty, somehow stuffy and airy simultaneously, where everyone (we were 5) had space to find peace and quiet if they wanted it. I could spend a whole day not seeing anyone, tucked away in my hammock or drawing or holding silent discos on the dancefloor with the giant inflatable and completely coincidental corona beer bottle (which J hosted a coronavirus party with just before lockdown) (what a man). But it was just as nice being with everyone, back together with Gem and Justino and even Chris who came from cusco to see us off and got trapped here too. With his cat. Poor thing.\n\nSo this was our life, cooking together, making flatbread, drinking beer up on the roof. The beautiful roof, saviour of lockdown, the sprawling view over lima carrying you just far enough to evade the claustrophobia knocking on the window. Might've encouraged some bad habits *cough* smoking *cough*, but we allowed ourselves the little escape from our desert island, adrift as the sun set over the urban ocean. Lima does host some stunning sunsets, when the churning chaos of the buildings gives way to the stark, undulating blanket of fairy lights stretching over the black Andean foothills. And then 8pm curfew hits, heralded nightly by someone blaring the national anthem loud enough to be heard across the Pacific. Who plays the (bloody long, but bloody great) national anthem, you might ask? None other than our lovely Justino of course, always providing the party to raucous cheers from his neighbours, and, eventually, the police. They weren't too thrilled at first, marrying their honking horns to our patriotic chorus, but after two weeks not even they could resist the searing pull of those lyrics, that marching band brass, the key changes.... yeah it's almost three minute long and every second is a joy to hear. Love that bloody anthem. Police weren't too thrilled about J trying to incite a salsa party afterwards, but you gotta take what you get.\n\nWe were exceedingly lucky to while away the lockdown in high-ceilinged comfort, not shut away in a hostel with strangers sharing rooms with 10 other people and devolving into Lord of the Flies with backpackers and instant noodles. Even our area was less strict and militarized; the military that pepper Chorrillos like Antony Gormley sculptures, however well-armed, are far outstripped by the toy soldier rows patrolling the centre of town. It was freaky leaving the house, illicitly purchasing beer through the bars of the shopfront which became harder and more fraught with fear the stricter alcohol regulations got, or once getting the bus alone which is something I prided myself in being good at in general, but made unsettling by the frosty interactions and crumbling ghost town around. G went a bit crazy being trapped in the house but (mama you will agree) I have an extraordinary capacity for doing absolutely nothing, and therefore it suited me quite well.\n\nChris and I set up a little drawing studio on the 3rd floor where I whiled away hour after hour, luxuriating in the time and state of relative restfulness. This whole trip has been excellent for my creativity, pushing me to work in a completely different manner to usual. On this trip, G and I have furiously scribbled away on snowing mountaintops, surreptitiously sketched in fancy government buildings, tried to draw in bumpy bus rides or swaying boats or surrounded by random people desperate to distract us at all costs (security guards get very bored....<3). Perched on some very precarious spots, in g's case more to get that perfect photo and in mine, well, let's just say there's a reason I fell through the roof. And always under time pressure! Always trying to finish before the sun sets, or the museum closes, the candle burns out or the rain gets too heavy for pencil to stick to paper (machu picchu lookin at u). Never sitting down to plan or develop, it was visceral, messy, utterly in-the-moment, a way of working I'm not accustomed to. Trying new materials, ways of drawing... I dislike a lot of what I drew, And a lot of it IS rushed and ugly, but there's bits of my sketchbook I'm so proud of.\n\nYeah quick detour there: it was therefore nice to come back to lima and proper sit down and spend TIME on drawings, filling in gaps that didn't quite get finished on hostel floors or waiting for the bus, drawing comics again, getting back a bit of the old mereida. Otherwise it was (MC) Hammock Time, letting our brains rot away to reruns of Friends or just lounging on the astroturf, increasing the yearning for Real Grass (and making your back really itchy). The only blight in Hotel Justino was the lil puppy, no longer really a puppy but strong enough to barge through many a blocked door and still ent-chew-siastic as ever. Bad pun, but she should be called Chewbacca not Nana.\n\nSo, there you go, how to survive lockdown in lima - all you really need is a hammock, an enormous inflatable coronabottle and speakers loud enough to give us all tinnitus. Oh wait.... nevermind.\n\n\nFrom my hammock\n\n(Yes it came back with me, what of it)\n\nMereida\n"}, {"title": "22 Home Sweet Home", "date": "19-04-2020", "href": "/_pages/newsblogs/19-04-2020.html", "src": "/assets/img/in/22_m.jpg", "content": "The Great Peruvian Rescue Mission:\n\nA story of intrigue, suspense and solidarity, involving: five aeroplanes; a race across the city; one daily mail reporter; some angry emails; and lots and lots of waiting!\n\n\nWoop woop we made it back to London! Three weeks ago, but the sentiments still ring true. Not that I had a problem being stuck in lima, I just didn't want to be stuck there indefinitely. The initial shutdown was only two weeks, but just like everywhere else it's been extended and extended and I'd rather be stuck at home in London for 3 months than lima. Despite the abundance of vegetables and national anthems. Our initial flight home, booked before even coming to Peru, was exactly a week after lockdown began. Ugh! So close to being such perfect timing! Still I can't complain, I was ready to come home, I know heaps and heaps of people who still had so much travel planned or who'd only just begun their trip. We were in Peru half a year, got so immensely lucky it only hit at the end!\n\nSo the mission was to try and get home, but the first week or so was pretty fruitless as all commercial flights were completely stopped and the British government were being NO HELP thanks a LOT guys great time to SHUT the British embassy in Lima. Excellent diplomacing there. I wasn't panicked, I was remarkably calm which by my standards isn't that hard though I'd like to point out my tendency to panic has greatly diminished over this trip. Thanks gemma. We were damn lucky to live with Justino and both have dual nationality, so my hopes were mostly pinned on the Germans who were so predictably organised we'd all been registered and guaranteed repatriation before the Brits even acknowledged our existence.\n\nNevertheless I kept up to date with the Brits ina WhatsApp chat for everyone stuck in peru who worked exceptionally hard in lobbying the government and shouting at the top of their voices since Raab seemed rather disinterested. In fairness everyone had a lot on their plate and bigger problems of an unprecedented nature, there wasn't a manual to follow (though since the government runs on precedent instead of constitution surely they should be used to it...?). Even the Peruvians were cooperative and on-board when it came to repatriation. But the brits were as helpful as butter knives to vulnerable people trapped, people who had absolutely no chance to get out the country because of Peru's short notice, and there weren't as many Brits in Peru as maybe elsewhere (about 1000, compared to 4000 Germans - good Lord no wonder we couldn't escape them) but how would they know if they didn't bother to find out.\n\nThe WhatsApp group was incredible though - I was in one for Germans as well, who after being registered and told to hold tight by their embassy proceeded to do nothing but moan and bitch about the apparent 'lack of action'. Instead, the Brits, who saw the government do absolutely shit all, banded together to launch an attack with an artillery of press interviews, petitions, strongly worded emails and the h-bomb that is Twitter. Not only did I first-hand experience the power of the press (lookin' at u, Daily Mail wink wink) (ok so they took all the worst bits from my interview but THEY USED OUR STUPID PHOTO FROM MACHU PICCHU! Famous and looking like a gay couple, I love the Mail) but what made me happiest was seeing all these people who'd probably never interact past a polite British hello in normal circumstances work together, support each other and work so hard to get each other home. The British government certainly left much to be desired, but these almost anonymous Brits made me proud to be British. And we never even met most of them!\n\nI didn't have a problem with drifting from day to day once the government got their shit together and I knew we'd be going home at some point, just savouring the sticky lima moments and unadulterated creativity that comes from deep boredom.  There was a lot of hopes being raised before quickly being dashed to the floor like a subpar wrestler whenever there were whispers of a plane, but it was only the governments complete lack of communication that rubbed me up the wrong way. Shouldn't have to get our news from Twitter, or other countries' embassies, or inside men at BA.... (I can link you to an eloquently angry email I wrote to Emily Thornberry rather than bore you here, boy do I write well when I'm angry). It was still quarantined bliss until they announced the LAST planes going to london and suddenly for two days It was STRESS. Well for me, G stayed unperturbed, but then again she didn't have to check her phone every hour in case they sent an email only giving us one hour to reply, as they did with the first plane. Grrrrrrrr. Anyway, we weren't put on either flight on Saturday, so for good measure I emailed the FCO a few more times begging them to put us on a plane (dignity went out the window but not politeness - think I wrote Please about 11 times). Sunday night the holy email arrived - we were going home!! Except the email wasn't holy at all, no it was rather more satanic, as I quote \n\n\"Tomorrow is the last planned UK flight.  Please make all efforts to turn up the airport if you wish to leave the country, but please note that spaces on the flight are limited.\"\n\nI will never forgive the FCO for that email, blame any high blood pressure I may develop later in life on this. Surprised I slept at all that night.\n\n\nThen, the fateful day: all clothes and books and brig-a-brac, dried llamas, two hammocks, a ginormous cow skull packed up, Justino drove us across the city one last time with his special 'I'm-friends-with-the-cops' driving permit, where incidentally I change my answer to Best Road in Peru. It might've been the sentimentality, the prospect of leaving, but my breathe was stolen by the view from the highway El Alto across boxy houses, that classic lima architecture, the slums creeping up the mountains in the morning mist. Lima, te amo.\n\nOnce we arrived at the queue at 6am, it was endgame and I could relax once more. Again, I'm surprised at my own capacity for calmness, but in the *does maths, is mildly horrified* 11  hours of queuing and waiting, not once was I stressed. Success! Enjoyed chatting to Brits again more than expected, the FCO staff were lovely and helpful and kept us up to speed on everything (doesnt make up for previous lack of communication, but highly appreciated) and wow BA planes are really classy. Didn't even have to go through security! It was just a sniffer dog who was more interested in people's lunches. So essentially we traded a 30 hour journey via toronto which apparently has nothing except snow cones for a luxury flight into Gatwick with (appropriate, but ONLY here never elsewhere) Plane Clapping and free loo roll they handed out at the end. Not complaining.\n\nYes, we made it back, they didn't stop the cow skull in G's suitcase, and suddenly we were walking though quiet empty COLD England and already it feels like we never left at all. I enjoyed lima lockdown frankly far too much, but with all the excitement and melodrama of trying to get home it never properly hit me we were leaving Peru. There was no bittersweet ending, no wistful tears, no chest-piercing over-the-shoulder glance. Now we're home and the memories are already slipping through my fingers all the time, I try to capture every minute, the feeling in it, can I just copy and paste abba lyrics here they can say it better than me. Furthermore, with this country now locked down too, it feels like were in limbo; having left lima but not arrived in london. It's deeply weird.\n\nNevertheless I am hugely grateful to the government for finally getting their shit together, to those working for BA, to everyone on that blessed group chat who not only worked hard to 'molest' the government (calm down it means annoy in Spanish. No moleste Jheremi!) but kept our spirits up by repeatedly posting the photo of the Israeli plane... I am glad to be home.\n\n\nThere will be at least one more email that is at yet unwritten looking back on the whole of Peru. 23 is an annoyingly unround number but it is prime...\n\n\nUntil then, from my hammock as I have been forever inducted into the hammock cult -\n\n\nMC Hammock\n"}]